dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
#include "NrfUsbd.h"
#include "TaichiUsb.h"  // TaichiUSB identity + build-flag guard (see header)

#include <cstring>

#include "Arduino.h"
#include "NrfBoard.h"
#include "NrfSystem.h"
#include "PluggableUSB.h"

namespace {
constexpr uint8_t USB_DIR_OUT = 0x00U;
constexpr uint8_t USB_DIR_IN = 0x80U;
constexpr uint8_t USB_REQ_GET_STATUS = 0x00U;
constexpr uint8_t USB_REQ_SET_ADDRESS = 0x05U;
constexpr uint8_t USB_REQ_GET_DESCRIPTOR = 0x06U;
constexpr uint8_t USB_REQ_GET_CONFIGURATION = 0x08U;
constexpr uint8_t USB_REQ_SET_CONFIGURATION = 0x09U;
constexpr uint8_t USB_REQ_GET_INTERFACE = 0x0AU;
constexpr uint8_t USB_REQ_SET_INTERFACE = 0x0BU;
constexpr uint8_t USB_REQ_CLEAR_FEATURE = 0x01U;
constexpr uint8_t USB_REQ_SET_FEATURE = 0x03U;
constexpr uint8_t USB_REQ_TYPE_STANDARD = 0x00U;
constexpr uint8_t USB_REQ_TYPE_CLASS = 0x20U;
constexpr uint8_t USB_REQ_RECIPIENT_DEVICE = 0x00U;
constexpr uint8_t USB_REQ_RECIPIENT_INTERFACE = 0x01U;
constexpr uint8_t USB_REQ_RECIPIENT_ENDPOINT = 0x02U;
constexpr uint16_t USB_FEATURE_ENDPOINT_HALT = 0x0000U;
constexpr uint8_t USB_DESC_DEVICE = 0x01U;
constexpr uint8_t USB_DESC_CONFIGURATION = 0x02U;
constexpr uint8_t USB_DESC_STRING = 0x03U;
constexpr uint8_t USB_DESC_INTERFACE = 0x04U;
constexpr uint8_t USB_DESC_ENDPOINT = 0x05U;
constexpr uint8_t USB_DESC_IAD = 0x0BU;
constexpr uint8_t USB_DESC_CS_INTERFACE = 0x24U;
constexpr uint8_t USB_DESC_DFU_FUNCTIONAL = 0x21U;
constexpr uint8_t CDC_REQ_SET_LINE_CODING = 0x20U;
constexpr uint8_t CDC_REQ_GET_LINE_CODING = 0x21U;
constexpr uint8_t CDC_REQ_SET_CONTROL_LINE_STATE = 0x22U;
constexpr uint8_t CDC_NOTIFICATION_SERIAL_STATE = 0x20U;
constexpr uint8_t DFU_REQ_DETACH = 0x00U;
constexpr uint8_t DFU_REQ_GETSTATUS = 0x03U;
constexpr uint8_t DFU_REQ_GETSTATE = 0x05U;
constexpr uint8_t DFU_STATE_APP_IDLE = 0x00U;
constexpr uint8_t DFU_STATUS_OK = 0x00U;
constexpr uint32_t USBD_BASE = 0x40027000UL;
// nRF52840 anomaly 199 workaround used by Nordic's nrfx USBD driver. While
// EasyDMA owns the peripheral, this latch prevents USB tasks/tokens from being
// lost. TaichiUSB serializes every endpoint DMA and brackets it with the same
// latch so EP0, both CDC functions, and pluggable endpoints cannot collide.
constexpr uint32_t USBD_DMA_TASK_HOLD = 0x40027C1CUL;
constexpr uint32_t USBD_DMA_TASK_HOLD_ENABLE = 0x00000082UL;
constexpr uint32_t POWER_BASE = 0x40000000UL;
constexpr uint32_t CLOCK_BASE = 0x40000000UL;
constexpr uint32_t TASKS_STARTEPIN_BASE = 0x004UL;
constexpr uint32_t TASKS_STARTEPOUT_BASE = 0x028UL;
constexpr uint32_t TASKS_EP0RCVOUT = 0x04CUL;
constexpr uint32_t TASKS_EP0STATUS = 0x050UL;
constexpr uint32_t TASKS_EP0STALL = 0x054UL;
constexpr uint32_t EVENTS_USBRESET = 0x100UL;
constexpr uint32_t EVENTS_STARTED = 0x104UL;
constexpr uint32_t EVENTS_ENDEPIN_BASE = 0x108UL;
constexpr uint32_t EVENTS_ENDEPOUT_BASE = 0x130UL;
constexpr uint32_t EVENTS_EP0DATADONE = 0x128UL;
constexpr uint32_t EVENTS_USBEVENT = 0x158UL;
constexpr uint32_t EVENTS_EP0SETUP = 0x15CUL;
constexpr uint32_t EVENTS_EPDATA = 0x160UL;
// nRF52840 USBD register map: EPSTATUS=0x468 (which endpoints' EasyDMA was
// captured), EPDATASTATUS=0x46C (which endpoints had an acknowledged host data
// transfer — the "this OUT packet is buffered, drain it" signal). USBADDR at
// 0x470 is read-only and must never be treated as an initialization register.
// This was previously 0x468, i.e. the firmware read EPSTATUS by mistake: its
// EP0 bits (EPIN0=bit0, EPOUT0=bit16) read as a constant 0x00010001 and its
// EPOUT data bits never reflect a freshly-arrived host packet, so the EPDATA
// handler never drained the service-CDC OUT endpoint — every host write NAK'd
// once the internal buffer filled. (Verified over SWD: with a packet buffered,
// 0x468 reads 0 while 0x46C has EPOUT2/bit18 set.) IN and enumeration were
// unaffected because they key off ENDEPIN/EP0 events, not EPDATASTATUS, which
// is why the GDB stub — the first feature to receive bulk OUT on the service
// CDC — was the first to expose this.
constexpr uint32_t EPSTATUS = 0x468UL;
constexpr uint32_t EPDATASTATUS = 0x46CUL;
constexpr uint32_t INTENSET = 0x304UL;
constexpr uint32_t INTENCLR = 0x308UL;
constexpr uint32_t EVENTCAUSE = 0x400UL;
constexpr uint32_t BMREQUESTTYPE = 0x480UL;
constexpr uint32_t BREQUEST = 0x484UL;
constexpr uint32_t WVALUEL = 0x488UL;
constexpr uint32_t WVALUEH = 0x48CUL;
constexpr uint32_t WINDEXL = 0x490UL;
constexpr uint32_t WINDEXH = 0x494UL;
constexpr uint32_t WLENGTHL = 0x498UL;
constexpr uint32_t WLENGTHH = 0x49CUL;
constexpr uint32_t ENABLE = 0x500UL;
constexpr uint32_t USBPULLUP = 0x504UL;
constexpr uint32_t DTOGGLE = 0x50CUL;
constexpr uint32_t EPINEN = 0x510UL;
constexpr uint32_t EPOUTEN = 0x514UL;
constexpr uint32_t EPSTALL = 0x518UL;
constexpr uint32_t USBD_EPSTALL_STALL = 1UL << 8U;
constexpr uint32_t EPOUT_PTR_BASE = 0x700UL;
constexpr uint32_t EPOUT_MAXCNT_BASE = 0x704UL;
constexpr uint32_t EPOUT_AMOUNT_BASE = 0x708UL;
constexpr uint32_t EPIN_PTR_BASE = 0x600UL;
constexpr uint32_t EPIN_MAXCNT_BASE = 0x604UL;
constexpr uint32_t USBD_ENDPOINT_CLUSTER_STRIDE = 0x14UL;
constexpr uint32_t POWER_USBREGSTATUS = 0x438UL;
constexpr uint32_t POWER_USBREGSTATUS_VBUSDETECT = 1UL;
constexpr uint32_t POWER_GPREGRET = 0x51CUL;
constexpr uint32_t NVIC_ISER_BASE = 0xE000E100UL;
constexpr uint32_t NVIC_ICER_BASE = 0xE000E180UL;
constexpr uint32_t CLOCK_TASKS_HFCLKSTART = 0x000UL;
constexpr uint32_t CLOCK_EVENTS_HFCLKSTARTED = 0x100UL;
constexpr uint32_t CLOCK_HFCLKSTAT = 0x40CUL;
constexpr uint32_t CLOCK_HFCLKSTAT_STATE = (1UL << 16);
constexpr uint32_t AIRCR = 0xE000ED0CUL;
constexpr uint32_t AIRCR_RESET_KEY = 0x05FA0000UL;
constexpr uint32_t AIRCR_SYSRESETREQ = 0x4UL;
extern "C" volatile uint32_t g_nrfDiagCause;
constexpr uint32_t USBD_DIAG_CAUSE_POLL_DETACH = 0xCA5E0002UL;
constexpr uint32_t USBD_DIAG_CAUSE_IRQ_DETACH = 0xCA5E0003UL;
constexpr uint32_t USBD_DIAG_CAUSE_1200_TOUCH = 0xCA5E1200UL;
constexpr uint32_t USBD_DIAG_CAUSE_1200_TOUCH_PENDING = 0xCA5E1201UL;
constexpr uint32_t USBD_DIAG_CAUSE_1200_LINE_CODING = 0xCA5E1202UL;
constexpr uint32_t USBD_DIAG_CAUSE_DFU_DETACH = 0xCA5E0DF0UL;
constexpr uint32_t USBD_DIAG_CAUSE_SERVICE_DATA_RX = 0xCA5E7200UL;
constexpr uint32_t USBD_DIAG_CAUSE_DIAG_STAGE_BASE = 0xCA5ED000UL;
constexpr uint32_t USBD_DETACH_REQUEST_MAGIC = 0xD37ACAFEUL;
constexpr uint32_t USBD_ENABLE_VALUE = 1UL;
constexpr uint32_t USBD_IRQ_NUMBER = 39UL;
constexpr uint32_t USBD_INT_USBRESET_MASK = (1UL << 0);
constexpr uint32_t USBD_INT_STARTED_MASK = (1UL << 1);
constexpr uint32_t USBD_INT_ENDEPIN0_MASK = (1UL << 2);
constexpr uint32_t USBD_INT_ENDEPIN1_MASK = (1UL << 3);
constexpr uint32_t USBD_INT_ENDEPIN2_MASK = (1UL << 4);
constexpr uint32_t USBD_INT_ENDEPIN3_MASK = (1UL << 5);
constexpr uint32_t USBD_INT_ENDEPIN4_MASK = (1UL << 6);
constexpr uint32_t USBD_INT_EP0DATADONE_MASK = (1UL << 10);
constexpr uint32_t USBD_INT_ENDEPOUT2_MASK = (1UL << 14);  // nRF52840 PS: ENDEPOUT[2] = bit 14
constexpr uint32_t USBD_INT_ENDEPOUT4_MASK = (1UL << 16);  // nRF52840 PS: ENDEPOUT[4] = bit 16
constexpr uint32_t USBD_INT_USBEVENT_MASK = (1UL << 22);
constexpr uint32_t USBD_INT_EP0SETUP_MASK = (1UL << 23);
// EPDATA fires whenever a non-EP0 IN/OUT transaction completes on the wire.
// EPDATASTATUS bits 17..23 indicate which OUT endpoint received data and
// needs an EasyDMA START to copy it from the internal buffer to RAM
// (Nordic: USBD_EPDATASTATUS_EPOUT1_Pos=17, EPOUT2=18 ... EPOUT7=23). The
// per-endpoint bit is therefore (17 + endpoint - 1) == (16 + endpoint).
// NOTE: this base was 16 (giving bit 17 for EP2 instead of 18), so the
// service-CDC OUT data-ready bit never matched, its DMA was never scheduled,
// and the first host OUT packet sat undrained in the endpoint's
// internal buffer — wedging every subsequent OUT into a NAK. That was the
// real cause of the GDB-stub "service CDC OUT NAKs while halted" bug: the
// stub is simply the first feature to receive bulk OUT on the service CDC
// (uploads only use EP0 control), so the latent off-by-one finally bit.
constexpr uint32_t USBD_INT_EPDATA_MASK = (1UL << 24);
constexpr uint32_t USBD_ACTIVE_INTERRUPT_MASK =
    USBD_INT_USBRESET_MASK |
    USBD_INT_STARTED_MASK |
    USBD_INT_ENDEPIN0_MASK |
    USBD_INT_ENDEPIN1_MASK |
    USBD_INT_ENDEPIN2_MASK |
    USBD_INT_ENDEPIN3_MASK |
    USBD_INT_ENDEPIN4_MASK |
    USBD_INT_EP0DATADONE_MASK |
    USBD_INT_ENDEPOUT2_MASK |
    USBD_INT_ENDEPOUT4_MASK |
    USBD_INT_USBEVENT_MASK |
    USBD_INT_EP0SETUP_MASK |
    USBD_INT_EPDATA_MASK;
constexpr uint32_t USBD_SUSPEND_INTERRUPT_MASK =
    USBD_INT_USBRESET_MASK | USBD_INT_USBEVENT_MASK;
constexpr uint32_t EPDATASTATUS_OUT_BASE_BIT = 17U;
constexpr uint32_t USBD_EVENTCAUSE_SUSPEND_MASK = (1UL << 8);
constexpr uint32_t USBD_EVENTCAUSE_RESUME_MASK = (1UL << 9);
constexpr uint32_t USBD_EVENTCAUSE_READY_MASK = (1UL << 11);
constexpr uint8_t SERVICE_NOTIFICATION_EP = 1U;
constexpr uint8_t SERVICE_DATA_EP = 2U;
constexpr uint8_t USER_NOTIFICATION_EP = 3U;
constexpr uint8_t USER_DATA_EP = 4U;
constexpr uint8_t SERVICE_CONTROL_INTERFACE = 0U;
constexpr uint8_t SERVICE_DATA_INTERFACE = 1U;
constexpr uint8_t USER_CONTROL_INTERFACE = 2U;
constexpr uint8_t USER_DATA_INTERFACE = 3U;
constexpr uint8_t USB_STRING_MANUFACTURER = 1U;
constexpr uint8_t USB_STRING_PRODUCT = 2U;
constexpr uint8_t USB_STRING_SERIAL = 3U;
constexpr uint8_t USB_STRING_SERVICE_CONTROL = 4U;
constexpr uint8_t USB_STRING_SERVICE_DATA = 5U;
constexpr uint8_t USB_STRING_USER_CONTROL = 6U;
constexpr uint8_t USB_STRING_USER_DATA = 7U;
constexpr uint8_t USB_STRING_DFU = 8U;
constexpr size_t CONTROL_EP_MAX_PACKET = 64U;
constexpr size_t DATA_EP_MAX_PACKET = 64U;
constexpr uint16_t CDC_SERIAL_STATE_DCD = 0x0001U;
constexpr uint16_t CDC_SERIAL_STATE_DSR = 0x0002U;
constexpr uint8_t USB_MAX_ENDPOINTS = 8U;

constexpr bool suspendedAfterUsbEvent(bool suspended, uint32_t cause) {
    // RESUME wins if delayed servicing observes both accumulated edges: bus
    // activity is present again and keeping the data plane suspended would
    // otherwise require another edge that the peripheral may not generate.
    return (cause & USBD_EVENTCAUSE_RESUME_MASK) != 0UL
        ? false
        : ((cause & USBD_EVENTCAUSE_SUSPEND_MASK) != 0UL ? true : suspended);
}

constexpr bool readyAfterUsbEvent(bool ready, bool attached, bool hasVbus,
                                  uint32_t cause) {
    return (cause & (USBD_EVENTCAUSE_READY_MASK | USBD_EVENTCAUSE_RESUME_MASK)) != 0UL
        ? (attached && hasVbus)
        : ready;
}

constexpr bool ep0DataDoneMayCommit(bool newerSetupPending) {
    // A new SETUP token aborts the older control transfer. Because firmware
    // must arm the new data stage after reading SETUP, a simultaneously latched
    // EP0DATADONE can only belong to the aborted request.
    return !newerSetupPending;
}

constexpr bool configurationRequestAllowed(uint8_t address) {
    // SET/GET_CONFIGURATION are valid only after SET_ADDRESS completed. A
    // default-state request must not construct endpoint/session state.
    return address != 0U;
}

constexpr bool rxRingCanAcceptPacket(size_t freeBytes, size_t packetBytes) {
    return packetBytes <= DATA_EP_MAX_PACKET && freeBytes >= packetBytes;
}

static_assert(suspendedAfterUsbEvent(false, USBD_EVENTCAUSE_SUSPEND_MASK));
static_assert(!suspendedAfterUsbEvent(true, USBD_EVENTCAUSE_RESUME_MASK));
static_assert(!suspendedAfterUsbEvent(true, USBD_EVENTCAUSE_SUSPEND_MASK |
                                           USBD_EVENTCAUSE_RESUME_MASK));
static_assert(readyAfterUsbEvent(false, true, true, USBD_EVENTCAUSE_READY_MASK));
static_assert(!readyAfterUsbEvent(true, true, false, USBD_EVENTCAUSE_RESUME_MASK));
static_assert(ep0DataDoneMayCommit(false));
static_assert(!ep0DataDoneMayCommit(true));
static_assert(!configurationRequestAllowed(0U));
static_assert(configurationRequestAllowed(1U));
static_assert(rxRingCanAcceptPacket(0U, 0U));
static_assert(rxRingCanAcceptPacket(1U, 1U));
static_assert(!rxRingCanAcceptPacket(63U, 64U));
constexpr uint32_t USBD_TRACE_MAGIC = 0x55444254UL;
constexpr uint32_t USBD_DTOGGLE_VALUE_POS = 8UL;
constexpr uint32_t USBD_DTOGGLE_NOP = 0UL;
constexpr uint32_t USBD_DTOGGLE_DATA0 = 1UL;
constexpr uint32_t USBD_START_CAPTURE_TIMEOUT_SPINS = 100000UL;
// Bounded spin for flush() while the GDB stub is halted (ISR-mode). Generous —
// the USBD ISR drains the IN ring between kicks — but finite so a host that
// stops reading can't wedge the stub forever.
constexpr uint32_t USBD_STUB_FLUSH_SPINS = 2000000UL;
constexpr size_t USBD_RING_BUFFER_SIZE = 256U;
#if defined(NRF_USBD_1200_RESET_ARM_MS)
constexpr uint32_t USBD_1200_RESET_ARM_MS = static_cast<uint32_t>(NRF_USBD_1200_RESET_ARM_MS);
#else
// The trigger already requires the maintenance CDC to be configured, receive
// an explicit 1200-bps line-coding request, and observe a DTR falling edge.
// Three seconds added no meaningful protection and made a second upload issued
// immediately after re-enumeration silently lose its touch. Windows can replay
// the port's previous line coding during the first few hundred milliseconds of
// enumeration, however, so the guard must extend past that setup traffic. The
// 400 ms boundary is the shortest value that survived repeated physical reset
// and CDC-traffic cycles on the ProMicro nRF52840 route.
constexpr uint32_t USBD_1200_RESET_ARM_MS = 400UL;
#endif
#if defined(NRF_USBD_IGNORE_INITIAL_1200_RESET_COUNT)
constexpr uint8_t USBD_IGNORE_INITIAL_1200_RESET_COUNT = static_cast<uint8_t>(NRF_USBD_IGNORE_INITIAL_1200_RESET_COUNT);
#else
constexpr uint8_t USBD_IGNORE_INITIAL_1200_RESET_COUNT = 0U;
#endif
constexpr uint32_t USBD_TOUCH_RESET_CONFIRM_MS = 40UL;
constexpr uint32_t USBD_DFU_DETACH_RESET_DELAY_MS = 20UL;
// usbser may assert DTR before its first bulk-IN read is posted. A short
// post-DTR guard prevents the application's first bytes from being committed
// to the endpoint FIFO before Windows is ready to consume them.
constexpr uint32_t USBD_CDC_OPEN_SETTLE_MS = 10UL;
// Controller startup is advanced in small, nonblocking steps from either the
// foreground poll path or SysTick. This lets USB recover after a cable is
// inserted while a sketch is busy-looping, without taking ownership of
// PendSV/POWER_CLOCK or blocking an interrupt for the old 400 ms handoff.
constexpr uint32_t USBD_HOST_HANDOFF_MS = 400UL;
constexpr uint32_t USBD_STARTUP_STAGE_TIMEOUT_MS = 100UL;
constexpr uint32_t USBD_STARTUP_RETRY_BACKOFF_MS = 10UL;

