dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
static_assert(USBD_INT_ENDEPOUT2_MASK == (1UL << 14),
              "nRF52840 ENDEPOUT2 interrupt position drifted");
static_assert(USBD_INT_ENDEPOUT4_MASK == (1UL << 16),
              "nRF52840 ENDEPOUT4 interrupt position drifted");

constexpr bool controlInNeedsZlp(size_t actualLength,
                                 size_t requestedLength,
                                 size_t maxPacket = CONTROL_EP_MAX_PACKET) {
    return actualLength > 0U && actualLength < requestedLength &&
           maxPacket > 0U && (actualLength % maxPacket) == 0U;
}

static_assert(controlInNeedsZlp(64U, 65U));
static_assert(!controlInNeedsZlp(64U, 64U));
static_assert(!controlInNeedsZlp(63U, 64U));

constexpr bool explicitTouchGesture(bool previousDtr,
                                    bool nextDtr,
                                    bool recent1200,
                                    bool resetArmed) {
    return previousDtr && !nextDtr && recent1200 && resetArmed;
}

static_assert(explicitTouchGesture(true, false, true, true));
static_assert(!explicitTouchGesture(false, false, true, true));
static_assert(!explicitTouchGesture(true, false, false, true));
static_assert(!explicitTouchGesture(true, false, true, false));

constexpr bool validCdcLineCoding(uint8_t stopBits,
                                  uint8_t parity,
                                  uint8_t dataBits) {
    const bool validDataBits = dataBits == 5U || dataBits == 6U ||
        dataBits == 7U || dataBits == 8U || dataBits == 16U;
    return stopBits <= 2U && parity <= 4U && validDataBits;
}

static_assert(validCdcLineCoding(0U, 0U, 8U));
static_assert(validCdcLineCoding(2U, 4U, 16U));
static_assert(!validCdcLineCoding(3U, 0U, 8U));
static_assert(!validCdcLineCoding(0U, 5U, 8U));
static_assert(!validCdcLineCoding(0U, 0U, 9U));

constexpr bool pluggableControlOutSupported(uint16_t length) {
    // The current setup() callback carries metadata only; it has no bounded
    // payload buffer or completion callback. A nonzero OUT data stage must not
    // be acknowledged until that ownership contract exists.
    return length == 0U;
}

static_assert(pluggableControlOutSupported(0U));
static_assert(!pluggableControlOutSupported(1U));

inline bool servicePortEnabled() {
    return nrfUsbServicePortEnabled();
}

inline bool userPortEnabled() {
    return nrfUsbUserPortEnabled();
}

inline uint8_t dfuInterfaceNumber() {
    return userPortEnabled() ? 4U : 2U;
}

inline uint8_t firstDynamicEndpoint() {
    return userPortEnabled() ? 5U : 3U;
}

inline volatile uint32_t &reg32(uint32_t base, uint32_t offset) {
    return *reinterpret_cast<volatile uint32_t *>(base + offset);
}

inline volatile uint32_t &mem32(uint32_t address) {
    return *reinterpret_cast<volatile uint32_t *>(address);
}

inline void enableNvicIrq(uint32_t irqNumber) {
    reg32(NVIC_ISER_BASE, (irqNumber / 32UL) * 4UL) = 1UL << (irqNumber % 32UL);
}

inline void disableNvicIrq(uint32_t irqNumber) {
    reg32(NVIC_ICER_BASE, (irqNumber / 32UL) * 4UL) = 1UL << (irqNumber % 32UL);
}

inline bool nvicIrqEnabled(uint32_t irqNumber) {
    return (reg32(NVIC_ISER_BASE, (irqNumber / 32UL) * 4UL) & (1UL << (irqNumber % 32UL))) != 0UL;
}

constexpr bool shouldRestoreUsbdIrq(bool wasEnabled, uint32_t peripheralMask) {
    return wasEnabled && peripheralMask != 0UL;
}

static_assert(shouldRestoreUsbdIrq(true, 1UL));
static_assert(!shouldRestoreUsbdIrq(true, 0UL));
static_assert(!shouldRestoreUsbdIrq(false, 1UL));

// NVIC priority registers are byte-addressable, one byte per IRQ. The nRF52840
// (Cortex-M4) implements the top 3 bits of the 8-bit field, so a logical
// priority 0..7 lives in bits [7:5].
constexpr uint32_t NVIC_IPR_BASE = 0xE000E400UL;
inline void setNvicPriority(uint32_t irqNumber, uint8_t priority) {
    *reinterpret_cast<volatile uint8_t *>(NVIC_IPR_BASE + irqNumber) =
        static_cast<uint8_t>((priority << 5) & 0xE0U);
}

// RAII mutual-exclusion between foreground USB servicing and the USBD ISR.
//
// Once the USBD interrupt is enabled, processBusState() /
// serviceDataIn() / serviceSetup() run from irqHandler() AND can still be
// reached from foreground (Serial.write -> serviceDataIn, flush(), poll() via
// yield()). They share USBD EasyDMA registers, the in-flight flags, and the
// TX-ring consumer cursor, so the two contexts must never overlap.
//
// Masking the USBD IRQ at the NVIC for the duration of a foreground critical
// section gives clean exclusion: the ISR runs at higher priority than any
// foreground code, so it can only start *between* foreground instructions --
// blocking it here means it cannot preempt us, and any event that arrives while
// masked simply stays pending and is taken the instant we unmask. The guard
// saves and restores the prior enable state, so it is a zero-cost no-op when the
// IRQ is temporarily disabled while the GDB stub holds it masked and
// nests correctly.
class UsbdIrqLock {
public:
    UsbdIrqLock() : reenable_(nvicIrqEnabled(USBD_IRQ_NUMBER)) {
        if (reenable_) {
            disableNvicIrq(USBD_IRQ_NUMBER);
            // Ensure the NVIC disable has taken architectural effect before the
            // critical section runs, so no USBD IRQ can still be in flight.
            asm volatile("dsb 0xf" ::: "memory");
            asm volatile("isb 0xf" ::: "memory");
        }
    }
    ~UsbdIrqLock() {
        // A critical-section body may retire the controller after observing
        // VBUS loss. disableInterrupts() then clears the peripheral mask as
        // well as the NVIC bit; do not undo that lifecycle decision merely
        // because the IRQ was enabled when this guard was entered.
        if (shouldRestoreUsbdIrq(reenable_, reg32(USBD_BASE, INTENSET))) {
            enableNvicIrq(USBD_IRQ_NUMBER);
        }
    }
    UsbdIrqLock(const UsbdIrqLock &) = delete;
    UsbdIrqLock &operator=(const UsbdIrqLock &) = delete;

private:
    const bool reenable_;
};

// Short core-state critical sections must also exclude SysTick because USB
// startup is deliberately advanced there. Preserve the caller's PRIMASK so an
// end()/detach() issued from an already-masked context never enables IRQs.
class CoreInterruptLock {
public:
    CoreInterruptLock() {
        asm volatile("mrs %0, primask" : "=r"(primask_) :: "memory");
        asm volatile("cpsid i" ::: "memory");
    }
    ~CoreInterruptLock() {
        if ((primask_ & 1UL) == 0UL) {
            asm volatile("cpsie i" ::: "memory");
        }
    }
    CoreInterruptLock(const CoreInterruptLock &) = delete;
    CoreInterruptLock &operator=(const CoreInterruptLock &) = delete;

