dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
private:
    uint32_t primask_ = 0UL;
};

inline uint32_t taskStartEpinOffset(uint8_t endpoint) {
    return TASKS_STARTEPIN_BASE + (static_cast<uint32_t>(endpoint) * 4UL);
}

inline uint32_t taskStartEpoutOffset(uint8_t endpoint) {
    return TASKS_STARTEPOUT_BASE + (static_cast<uint32_t>(endpoint) * 4UL);
}

inline uint32_t eventEndEpinOffset(uint8_t endpoint) {
    return EVENTS_ENDEPIN_BASE + (static_cast<uint32_t>(endpoint) * 4UL);
}

inline uint32_t eventEndEpoutOffset(uint8_t endpoint) {
    return EVENTS_ENDEPOUT_BASE + (static_cast<uint32_t>(endpoint) * 4UL);
}

inline uint32_t epoutPtrOffset(uint8_t endpoint) {
    return EPOUT_PTR_BASE + (static_cast<uint32_t>(endpoint) * USBD_ENDPOINT_CLUSTER_STRIDE);
}

inline uint32_t epoutMaxcntOffset(uint8_t endpoint) {
    return EPOUT_MAXCNT_BASE + (static_cast<uint32_t>(endpoint) * USBD_ENDPOINT_CLUSTER_STRIDE);
}

inline uint32_t epoutAmountOffset(uint8_t endpoint) {
    return EPOUT_AMOUNT_BASE + (static_cast<uint32_t>(endpoint) * USBD_ENDPOINT_CLUSTER_STRIDE);
}

// SIZE.EPOUT[n] (0x4A0 + n*4): reading gives the byte count of the packet
// sitting in the endpoint's internal buffer; WRITING any value is the
// documented "buffer consumed" handshake that lets the endpoint ACK the next
// host OUT. Skipping this write is what made this clone re-present stale
// FIFO content as phantom packets after every real one.
inline uint32_t sizeEpoutOffset(uint8_t endpoint) {
    return 0x4A0UL + (static_cast<uint32_t>(endpoint) * 4UL);
}

inline uint32_t epinPtrOffset(uint8_t endpoint) {
    return EPIN_PTR_BASE + (static_cast<uint32_t>(endpoint) * USBD_ENDPOINT_CLUSTER_STRIDE);
}

inline uint32_t epinMaxcntOffset(uint8_t endpoint) {
    return EPIN_MAXCNT_BASE + (static_cast<uint32_t>(endpoint) * USBD_ENDPOINT_CLUSTER_STRIDE);
}

inline uint32_t endpointMask(uint8_t endpoint) {
    return 1UL << endpoint;
}

inline uint8_t epAddressIn(uint8_t endpoint) {
    return static_cast<uint8_t>(USB_DIR_IN | endpoint);
}

inline uint8_t epAddressOut(uint8_t endpoint) {
    return static_cast<uint8_t>(USB_DIR_OUT | endpoint);
}

inline void clearEndpointToggle(uint8_t endpointAddress) {
    reg32(USBD_BASE, DTOGGLE) = endpointAddress | (USBD_DTOGGLE_NOP << USBD_DTOGGLE_VALUE_POS);
    reg32(USBD_BASE, DTOGGLE) = endpointAddress | (USBD_DTOGGLE_DATA0 << USBD_DTOGGLE_VALUE_POS);
}

inline void clearEndpointStall(uint8_t endpointAddress) {
    reg32(USBD_BASE, EPSTALL) = endpointAddress;
}

inline void stallEndpoint(uint8_t endpointAddress) {
    reg32(USBD_BASE, EPSTALL) = USBD_EPSTALL_STALL | endpointAddress;
}

inline void resetEndpointDataState(uint8_t endpointAddress) {
    clearEndpointToggle(endpointAddress);
    clearEndpointStall(endpointAddress);
}

inline bool triggerEndpointStartTask(uint32_t taskOffset) {
    uint32_t endEventOffset = 0UL;
    if (taskOffset >= TASKS_STARTEPIN_BASE &&
        taskOffset <= taskStartEpinOffset(USB_MAX_ENDPOINTS - 1U)) {
        const uint8_t endpoint = static_cast<uint8_t>((taskOffset - TASKS_STARTEPIN_BASE) / 4UL);
        endEventOffset = eventEndEpinOffset(endpoint);
    } else if (taskOffset >= TASKS_STARTEPOUT_BASE &&
               taskOffset <= taskStartEpoutOffset(USB_MAX_ENDPOINTS - 1U)) {
        const uint8_t endpoint = static_cast<uint8_t>((taskOffset - TASKS_STARTEPOUT_BASE) / 4UL);
        endEventOffset = eventEndEpoutOffset(endpoint);
    } else {
        return false;
    }

    // EVENTS_STARTED means only that the task was captured, not that EasyDMA
    // is free for another endpoint. Waiting for END mirrors nrfx's stable
    // scheduler and keeps register accesses outside an active DMA window.
    reg32(USBD_BASE, endEventOffset) = 0UL;
    reg32(USBD_BASE, EVENTS_STARTED) = 0UL;
    reg32(0UL, USBD_DMA_TASK_HOLD) = USBD_DMA_TASK_HOLD_ENABLE;
    reg32(USBD_BASE, taskOffset) = 1UL;
    asm volatile("dsb 0xf" ::: "memory");
    asm volatile("isb 0xf" ::: "memory");
    for (uint32_t spin = 0UL; spin < USBD_START_CAPTURE_TIMEOUT_SPINS; ++spin) {
        if (reg32(USBD_BASE, endEventOffset) != 0UL) {
            reg32(USBD_BASE, EVENTS_STARTED) = 0UL;
            reg32(0UL, USBD_DMA_TASK_HOLD) = 0UL;
            return true;
        }
    }
    reg32(0UL, USBD_DMA_TASK_HOLD) = 0UL;
    return false;
}

inline bool vbusDetected() {
    return (reg32(POWER_BASE, POWER_USBREGSTATUS) & POWER_USBREGSTATUS_VBUSDETECT) != 0UL;
}

inline bool hfclkRunning() {
    return (reg32(CLOCK_BASE, CLOCK_HFCLKSTAT) & CLOCK_HFCLKSTAT_STATE) != 0UL;
}

inline bool deadlineReached(uint32_t now, uint32_t deadline) {
    return static_cast<int32_t>(now - deadline) >= 0;
}

// nRF52840 POWER->USBREGSTATUS bit 1 = OUTPUTRDY (USB regulator stable).
// VBUSDETECT must be asserted before USBD->ENABLE. ENABLE then starts the
// dedicated regulator; OUTPUTRDY and controller READY must both be observed
// before the pull-up can be connected. A bootloader hand-off may inherit any
// intermediate state, so neither acknowledgement is inferred from it.
constexpr uint32_t POWER_USBREGSTATUS_OUTPUTRDY = (1UL << 1);

inline bool usbPwrRdy() {
    return (reg32(POWER_BASE, POWER_USBREGSTATUS) & POWER_USBREGSTATUS_OUTPUTRDY) != 0UL;
}

// nRF52840 Errata 187 ("USBD: USB cannot be enabled"): wraps the USBD
// ENABLE handshake with a trim-register sequence at 0x4006EC00 / 0x4006ED14.
// CRITICAL: the canonical Nordic nrfx_usbd implementation READS 0x4006EC00
// first; if it's already non-zero (e.g., the bootloader's nrfx_usbd primed
// it before handing off via NVIC_SystemReset), only the flag at 0x4006ED14
// is updated. Writing 0x9375 unconditionally to 0x4006EC00 CORRUPTS the
// trim and the USBD peripheral then enumerates with garbage descriptors
// (host sees the device but never binds it). Reproduced exactly as
// nrfx_usbd::usbd_errata_187_211_begin / _end.
inline void usbErrata187First() {
    if (*reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) == 0x00000000UL) {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006ED14UL) = 0x00000003UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
    } else {
        *reinterpret_cast<volatile uint32_t *>(0x4006ED14UL) = 0x00000003UL;
    }
}

