dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
inline void usbErrata187Second() {
    if (*reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) == 0x00000000UL) {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006ED14UL) = 0x00000000UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
    } else {
        *reinterpret_cast<volatile uint32_t *>(0x4006ED14UL) = 0x00000000UL;
    }
}

// nRF52840 Errata 171 ("USBD: USB might not power up"): Nordic's nrfx_usbd
// applies this workaround inside Errata 187 around the ENABLE handshake.
// Same gating: read 0x4006EC00; if zero, do the full magic-flag-magic
// sequence; otherwise just update the flag at 0x4006EC14 (note: EC14, NOT
// the 0x4006ED14 used by 187). Magic value is 0xC0 (vs. 0x3 for 187).
inline void usbErrata171First() {
    if (*reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) == 0x00000000UL) {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC14UL) = 0x000000C0UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
    } else {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC14UL) = 0x000000C0UL;
    }
}

inline void usbErrata171Second() {
    if (*reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) == 0x00000000UL) {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC14UL) = 0x00000000UL;
        *reinterpret_cast<volatile uint32_t *>(0x4006EC00UL) = 0x00009375UL;
    } else {
        *reinterpret_cast<volatile uint32_t *>(0x4006EC14UL) = 0x00000000UL;
    }
}

constexpr uint32_t USBD_BOOTLOADER_RESET_DISCONNECT_SPINS = 640000UL;

inline void requestBootloaderReset() {
    reg32(USBD_BASE, USBPULLUP) = 0UL;
    reg32(USBD_BASE, ENABLE) = 0UL;
    for (volatile uint32_t spin = 0UL; spin < USBD_BOOTLOADER_RESET_DISCONNECT_SPINS; ++spin) {
        __asm volatile("nop");
    }
    nrfPrepareBootloaderResetRequest(nrfBootloaderUploadResetMagic());
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    mem32(AIRCR) = AIRCR_RESET_KEY | AIRCR_SYSRESETREQ;
    __asm volatile("dsb 0xF" ::: "memory");
    while (true) {
    }
}

inline void markResetCause(uint32_t cause) {
    g_nrfDiagCause = cause;
}

inline void markResetCauseIfUnset(uint32_t cause) {
    if (g_nrfDiagCause == 0UL) {
        markResetCause(cause);
    }
}

inline void diagResetAtUsbdBeginStage(uint32_t stage) {
#if defined(NRF_USBD_DIAG_RESET_STAGE)
    if (static_cast<uint32_t>(NRF_USBD_DIAG_RESET_STAGE) == stage) {
        markResetCause(USBD_DIAG_CAUSE_DIAG_STAGE_BASE | (stage & 0xFFUL));
        requestBootloaderReset();
    }
#else
    (void)stage;
#endif
}

inline size_t copyUsbStringDescriptor(const char *text, uint8_t *buffer, size_t capacity) {
    if (capacity < 2U) {
        return 0U;
    }

    size_t offset = 2U;
    while (text != nullptr && *text != '\0' && (offset + 1U) < capacity) {
        buffer[offset++] = static_cast<uint8_t>(*text++);
        buffer[offset++] = 0U;
    }
    buffer[0] = static_cast<uint8_t>(offset);
    buffer[1] = USB_DESC_STRING;
    return offset;
}

inline void ringPush(uint8_t *buffer, volatile size_t &head, volatile size_t &tail, uint8_t value) {
    const size_t next = (head + 1U) % USBD_RING_BUFFER_SIZE;
    if (next == tail) {
        return;
    }
    buffer[head] = value;
    head = next;
}

inline bool ringPushWithResult(uint8_t *buffer, volatile size_t &head, volatile size_t &tail, uint8_t value) {
    const size_t next = (head + 1U) % USBD_RING_BUFFER_SIZE;
    if (next == tail) {
        return false;
    }
    buffer[head] = value;
    head = next;
    return true;
}

inline int ringPop(uint8_t *buffer, volatile size_t &head, volatile size_t &tail) {
    if (head == tail) {
        return -1;
    }
    const uint8_t value = buffer[tail];
    tail = (tail + 1U) % USBD_RING_BUFFER_SIZE;
    return static_cast<int>(value);
}

inline int ringPeek(const uint8_t *buffer, volatile size_t head, volatile size_t tail) {
    if (head == tail) {
        return -1;
    }
    return static_cast<int>(buffer[tail]);
}

inline size_t ringPending(volatile size_t head, volatile size_t tail) {
    if (head >= tail) {
        return head - tail;
    }
    return (USBD_RING_BUFFER_SIZE - tail) + head;
}

NrfUsbdPollTrace g_usbdPollTrace __attribute__((section(".noinit")));

bool pollTraceEnabled() {
    return g_usbdPollTrace.magic == USBD_TRACE_MAGIC;
}

void zeroPollTrace() {
    g_usbdPollTrace.pollCalls = 0UL;
    g_usbdPollTrace.irqCalls = 0UL;
    g_usbdPollTrace.ep0SetupEvents = 0UL;
    g_usbdPollTrace.ep0DataDoneEvents = 0UL;
    g_usbdPollTrace.cdcOutEvents = 0UL;
    g_usbdPollTrace.cdcInEvents = 0UL;
    g_usbdPollTrace.usbEventEvents = 0UL;
    g_usbdPollTrace.lastEventCause = 0UL;
}
}

NrfUsbdDriver &nrfUsbdDriver() {
    static NrfUsbdDriver driver;
    return driver;
}

const NrfUsbdPollTrace &nrfUsbdPollTrace() {
    return g_usbdPollTrace;
}

void nrfUsbdResetPollTrace() {
    g_usbdPollTrace.magic = USBD_TRACE_MAGIC;
    zeroPollTrace();
}

void nrfUsbdClearPollTrace() {
    g_usbdPollTrace.magic = 0UL;
    zeroPollTrace();
}

void NrfUsbdDriver::begin() {
    if (!nrfUsbRuntimeEnabled()) {
        return;
    }
    CoreInterruptLock lock;
    startRequested_ = true;
    serviceStartup();
}

void NrfUsbdDriver::requestStartupAbort(bool terminal) {
    reg32(USBD_BASE, USBPULLUP) = 0UL;
    reg32(USBD_BASE, ENABLE) = 0UL;
    startupAbortTerminal_ = terminal;
    startupDeadlineMillis_ = millis() + USBD_STARTUP_STAGE_TIMEOUT_MS;
    startupPhase_ = StartupPhase::AbortDisable;
}

void NrfUsbdDriver::serviceStartup() {
    const bool aborting = startupPhase_ == StartupPhase::AbortDisable;
    if (enabled_ || startupFaulted_ || startupServicing_ ||
        (!aborting && (!startRequested_ || !nrfUsbRuntimeEnabled()))) {
        return;
    }

    // serviceStartup() may be entered from foreground poll() and preempted by
    // SysTick. The byte-sized guard makes the interrupt-side call a no-op until
    // the foreground step has committed its next phase.
    startupServicing_ = true;
    const uint32_t now = millis();

