dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
    switch (startupPhase_) {
    case StartupPhase::Idle:
        // VBUS is a hard precondition for ENABLE on nRF52840. Retain the start
        // request while disconnected; SysTick will notice insertion even if a
        // sketch never calls yield().
        if (!vbusDetected()) {
            break;
        }
        startupInProgress_ = true;
        startupErrataOpen_ = false;
        reg32(USBD_BASE, USBPULLUP) = 0UL;
        reg32(USBD_BASE, ENABLE) = 0UL;
        startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
        startupPhase_ = StartupPhase::DisableInherited;
        break;

    case StartupPhase::DisableInherited:
        // A bootloader can hand the peripheral over while its pull-up is still
        // live. Prove ENABLE=0 before starting the host-disconnect dwell.
        if (reg32(USBD_BASE, ENABLE) == 0UL) {
            startupDeadlineMillis_ = now + USBD_HOST_HANDOFF_MS;
            startupPhase_ = StartupPhase::HostHandoff;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            requestStartupAbort(true);
        }
        break;

    case StartupPhase::HostHandoff:
        if (!vbusDetected()) {
            startupInProgress_ = false;
            startupPhase_ = StartupPhase::Idle;
            break;
        }
        if (deadlineReached(now, startupDeadlineMillis_)) {
            diagResetAtUsbdBeginStage(1UL);
            reg32(CLOCK_BASE, CLOCK_EVENTS_HFCLKSTARTED) = 0UL;
            reg32(CLOCK_BASE, CLOCK_TASKS_HFCLKSTART) = 1UL;
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::Hfclk;
        }
        break;

    case StartupPhase::Hfclk:
        if (!vbusDetected()) {
            requestStartupAbort(false);
            break;
        }
        if (reg32(CLOCK_BASE, CLOCK_EVENTS_HFCLKSTARTED) != 0UL || hfclkRunning()) {
            if (!initDescriptors()) {
                // Never expose a truncated composite configuration to the host.
                requestStartupAbort(true);
                break;
            }
            diagResetAtUsbdBeginStage(2UL);
            diagResetAtUsbdBeginStage(3UL);
            usbErrata187First();
            usbErrata171First();
            startupErrataOpen_ = true;
            clearEvents();
            reg32(USBD_BASE, ENABLE) = USBD_ENABLE_VALUE;
            diagResetAtUsbdBeginStage(4UL);
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::Ready;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            requestStartupAbort(true);
        }
        break;

    case StartupPhase::Ready:
        if ((reg32(USBD_BASE, EVENTCAUSE) & USBD_EVENTCAUSE_READY_MASK) != 0UL) {
            reg32(USBD_BASE, EVENTCAUSE) = USBD_EVENTCAUSE_READY_MASK;
            diagResetAtUsbdBeginStage(5UL);
            usbErrata171Second();
            usbErrata187Second();
            startupErrataOpen_ = false;
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::OutputReady;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            // One bounded, fully bracketed retry covers a bootloader handoff
            // that left the controller between states. No retry is attempted
            // after any endpoint or flash mutation.
            reg32(USBD_BASE, USBPULLUP) = 0UL;
            reg32(USBD_BASE, ENABLE) = 0UL;
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::RetryDisable;
        }
        break;

    case StartupPhase::RetryDisable:
        if (reg32(USBD_BASE, ENABLE) == 0UL) {
            if (startupErrataOpen_) {
                usbErrata171Second();
                usbErrata187Second();
                startupErrataOpen_ = false;
            }
            if (!vbusDetected()) {
                requestStartupAbort(false);
                break;
            }
            startupDeadlineMillis_ = now + USBD_STARTUP_RETRY_BACKOFF_MS;
            startupPhase_ = StartupPhase::RetryBackoff;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            requestStartupAbort(true);
        }
        break;

    case StartupPhase::RetryBackoff:
        if (!vbusDetected()) {
            requestStartupAbort(false);
            break;
        }
        if (deadlineReached(now, startupDeadlineMillis_)) {
            usbErrata187First();
            usbErrata171First();
            startupErrataOpen_ = true;
            clearEvents();
            reg32(USBD_BASE, ENABLE) = USBD_ENABLE_VALUE;
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::RetryReady;
        }
        break;

    case StartupPhase::RetryReady:
        if ((reg32(USBD_BASE, EVENTCAUSE) & USBD_EVENTCAUSE_READY_MASK) != 0UL) {
            reg32(USBD_BASE, EVENTCAUSE) = USBD_EVENTCAUSE_READY_MASK;
            diagResetAtUsbdBeginStage(5UL);
            usbErrata171Second();
            usbErrata187Second();
            startupErrataOpen_ = false;
            startupDeadlineMillis_ = now + USBD_STARTUP_STAGE_TIMEOUT_MS;
            startupPhase_ = StartupPhase::OutputReady;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            requestStartupAbort(vbusDetected());
        }
        break;

    case StartupPhase::OutputReady:
        if (!vbusDetected()) {
            requestStartupAbort(false);
            break;
        }
        if (usbPwrRdy()) {
            enabled_ = true;
            started_ = true;
            attached_ = true;
            resetConnectionState();
            ready_ = true;
            enableInterrupts();
            enablePullup(true);
            configStartMillis_ = now;
            startupInProgress_ = false;
            startupPhase_ = StartupPhase::Idle;
            diagResetAtUsbdBeginStage(6UL);
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            requestStartupAbort(true);
        }
        break;

    case StartupPhase::AbortDisable:
        if (reg32(USBD_BASE, ENABLE) == 0UL) {
            if (startupErrataOpen_) {
                usbErrata171Second();
                usbErrata187Second();
                startupErrataOpen_ = false;
            }
            clearEvents();
            disableInterrupts();
            enabled_ = false;
            started_ = false;
            ready_ = false;
            configured_ = false;
            suspended_ = false;
            cdcActive_ = false;
            resetConnectionState();
            startupFaulted_ = startupAbortTerminal_;
            startupInProgress_ = false;
            startupPhase_ = startupFaulted_ ? StartupPhase::Faulted : StartupPhase::Idle;
        } else if (deadlineReached(now, startupDeadlineMillis_)) {
            // Do not close errata brackets while ENABLE ownership is unknown.
            // A chip reset is the only safe recovery boundary.
            startupFaulted_ = true;
            startupInProgress_ = false;
            startupPhase_ = StartupPhase::Faulted;
        }
        break;

