dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
    case StartupPhase::Faulted:
        break;
    }

    startupServicing_ = false;
}

void NrfUsbdDriver::end() {
    CoreInterruptLock lock;
    enablePullup(false);
    disableInterrupts();
    reg32(USBD_BASE, ENABLE) = 0UL;
    const bool startupNeedsAbort = startupInProgress_ || startupErrataOpen_ ||
        (startupPhase_ != StartupPhase::Idle && startupPhase_ != StartupPhase::Faulted);
    enabled_ = false;
    started_ = false;
    attached_ = false;
    startRequested_ = false;
    if (startupNeedsAbort) {
        // Finish the disable acknowledgement and close any open errata brackets
        // from SysTick. Silently discarding that ownership state can poison the
        // next begin() after Serial.end()/detach() races startup.
        startupAbortTerminal_ = false;
        startupDeadlineMillis_ = millis() + USBD_STARTUP_STAGE_TIMEOUT_MS;
        startupPhase_ = StartupPhase::AbortDisable;
    } else {
        startupInProgress_ = false;
        startupAbortTerminal_ = false;
        startupPhase_ = startupFaulted_ ? StartupPhase::Faulted : StartupPhase::Idle;
        startupDeadlineMillis_ = 0UL;
    }
    ready_ = false;
    resetConnectionState();
    pendingControlOut_ = ControlOutTransfer::None;
    controlOutExpected_ = 0U;
    controlOutLength_ = 0U;
    rxHead_ = 0U;
    rxTail_ = 0U;
    txHead_ = 0U;
    txTail_ = 0U;
    userRxHead_ = 0U;
    userRxTail_ = 0U;
    userTxHead_ = 0U;
    userTxTail_ = 0U;
    eventCause_ = 0UL;
    serialStateBitmap_ = 0U;
    userSerialStateBitmap_ = 0U;
    reg32(USBD_BASE, EPINEN) = 0UL;
    reg32(USBD_BASE, EPOUTEN) = 0UL;
}

void NrfUsbdDriver::attach() {
    if (!nrfUsbRuntimeEnabled()) {
        return;
    }
    CoreInterruptLock lock;
    startRequested_ = true;
    if (!enabled_) {
        serviceStartup();
        return;
    }

    // A live attach is idempotent. Resetting configuration or endpoint state
    // here leaves the pull-up asserted, so the host has no disconnect event
    // with which to rebuild the state that the device just discarded.
    if (attached_) {
        enablePullup(vbusDetected());
        return;
    }

    attached_ = true;
    resetConnectionState();
    clearEvents();
    started_ = true;
    enablePullup(vbusDetected());
}

void NrfUsbdDriver::detach() {
    CoreInterruptLock lock;
    startRequested_ = false;
    if (!enabled_) {
        attached_ = false;
        if (startupInProgress_ || startupErrataOpen_ ||
            (startupPhase_ != StartupPhase::Idle && startupPhase_ != StartupPhase::Faulted)) {
            requestStartupAbort(false);
        }
        return;
    }

    attached_ = false;
    enablePullup(false);
    resetConnectionState();
    clearEvents();
}

void NrfUsbdDriver::poll() {
    if (!enabled_) {
        if (startRequested_) {
            begin();
        }
        return;
    }

    if (pollTraceEnabled()) {
        ++g_usbdPollTrace.pollCalls;
    }

    // Serialize against the USBD ISR: poll() and irqHandler() run the same
    // servicing routines and touch the same registers/state. With the IRQ live
    // (interrupt-driven builds) this mask makes the whole foreground pass atomic
    // w.r.t. the ISR; while the GDB stub deliberately masks the IRQ this is a
    // no-op and the stub pumps the same service path explicitly.
    UsbdIrqLock lock;

    const bool hasVbus = vbusDetected();
    enablePullup(attached_ && hasVbus);
    processBusState(hasVbus);

    if (attached_ && hasVbus) {
        started_ = true;
    }

    // nRF52840 has one shared USBD EasyDMA engine. Do not launch a CDC,
    // notification, or pluggable-endpoint transfer while EP0 owns that engine;
    // doing so can replace the first-open GET/SET_LINE_CODING response and make
    // Windows wait for usbser.sys' 30-second control-transfer timeout.
    const bool controlPlaneIdle =
        ep0InXferPhase_ == Ep0InXferPhase::Idle &&
        pendingControlOut_ == ControlOutTransfer::None;
    if (attached_ && configured_ && !suspended_ && controlPlaneIdle) {
        serviceDataIn(false);
        serviceNotificationIn(false);
        if (userPortEnabled()) {
            serviceDataIn(true);
            serviceNotificationIn(true);
        }
    }

    serviceTouchTimer();
    serviceDetachTimer();
    diagResetAtUsbdBeginStage(23UL);
}

void NrfUsbdDriver::irqHandler() {
    if (!enabled_) {
        return;
    }

    if (pollTraceEnabled()) {
        ++g_usbdPollTrace.irqCalls;
    }

    processBusState(vbusDetected());
    const bool controlPlaneIdle =
        ep0InXferPhase_ == Ep0InXferPhase::Idle &&
        pendingControlOut_ == ControlOutTransfer::None;
    if (attached_ && configured_ && !suspended_ && controlPlaneIdle) {
        serviceDataIn(false);
        serviceNotificationIn(false);
        if (userPortEnabled()) {
            serviceDataIn(true);
            serviceNotificationIn(true);
        }
    }
    serviceTouchTimer();
    serviceDetachTimer();
}

// Number of consecutive halted-pump iterations the host must hold the service
// CDC has delivered the explicit 1200-bps/DTR-falling upload gesture before we
// reboot to the bootloader. The stub busy-loops the pump, so this is a debounce
// against a torn control transaction, not
// a wall-clock interval (millis() is frozen during the DebugMon halt).
// The halted stub has already observed a configured service CDC at 1200 baud;
// this is an explicit upload request, not ambient serial traffic. Keep a short
// poll debounce to reject a torn control transfer, but do not make recovery
// depend on thousands of USB service passes (some passes wait on EasyDMA and
// turned a valid touch into a tens-of-seconds escape).
constexpr uint32_t USBD_HALT_TOUCH_CONFIRM_TICKS = 32UL;

void NrfUsbdDriver::setStubHalted(bool halted) {
    stubHalted_ = halted;
    haltTouchTicks_ = 0UL;
}

void NrfUsbdDriver::serviceHaltedTouch() {
    // Only meaningful while the GDB stub is pumping us from its halted loop.
    if (!stubHalted_) {
        haltTouchTicks_ = 0UL;
        return;
    }
    // The maintenance CDC must receive both 1200-bps line coding and a DTR
    // falling edge. Merely selecting 1200 baud is not an upload request.
    // lineCoding_ is
    // updated from EP0 control-OUT (completeControlOutTransfer), which still
    // completes while halted — that is how re-enumeration finishes — so this
    // signal is observable even though millis() is frozen.
    // Honor the touch even while halted in the GDB stub debugger, on any profile -
    // a debug build must still be DFU-recoverable over USB.
    const bool touchSignal = enabled_ && configured_ && serviceTouchPending_ &&
        lineCoding_.baudRate == 1200UL;
    if (!touchSignal) {
        haltTouchTicks_ = 0UL;
        return;
    }
    if (++haltTouchTicks_ >= USBD_HALT_TOUCH_CONFIRM_TICKS) {
        // Reboot into the bootloader so the upload's DFU write lands on the
        // bootloader (which programs flash safely) instead of stalling against a
        // halted app and leaving a partially-written, bricked image.
        markResetCause(USBD_DIAG_CAUSE_1200_TOUCH);
        requestBootloaderReset();  // never returns
    }
}

void NrfUsbdDriver::processBusState(bool hasVbus) {
    if (!hasVbus) {
        if (enabled_) {
            // VBUS removal powers down the USB regulator. Keeping ENABLE and
            // the old configured/endpoint state across that boundary lets a
            // later cable insertion expose a stale session before OUTPUTRDY.
            // Preserve logical attach/start intent, but retire this controller
            // instance. The normal begin() path will prove disable readback,
            // open fresh errata brackets, wait for READY + OUTPUTRDY, and only
            // then reconnect the pull-up.
            enablePullup(false);
            disableInterrupts();
            reg32(USBD_BASE, ENABLE) = 0UL;
            enabled_ = false;
            started_ = false;
            ready_ = false;
            startupInProgress_ = false;
            startupErrataOpen_ = false;
            startupAbortTerminal_ = false;
            startupPhase_ = StartupPhase::Idle;
            startupDeadlineMillis_ = 0UL;
            resetConnectionState();
        }
        return;
    }

    const bool wasSuspended = suspended_;
    if (reg32(USBD_BASE, EVENTS_USBRESET) != 0UL) {
        reg32(USBD_BASE, EVENTS_USBRESET) = 0UL;
        resetConnectionState();
    }

    // Apply suspend/resume before servicing EP0 or endpoint events from the
    // same interrupt snapshot. Handling this at the end of the pass let a
    // latched SUSPEND edge leave the old active state visible while transfer
    // completion code considered launching more work.
    if (reg32(USBD_BASE, EVENTS_USBEVENT) != 0UL) {
        reg32(USBD_BASE, EVENTS_USBEVENT) = 0UL;
        eventCause_ = reg32(USBD_BASE, EVENTCAUSE);
        if (pollTraceEnabled()) {
            ++g_usbdPollTrace.usbEventEvents;
            g_usbdPollTrace.lastEventCause = eventCause_;
        }
        ready_ = readyAfterUsbEvent(ready_, attached_, hasVbus, eventCause_);
        suspended_ = suspendedAfterUsbEvent(suspended_, eventCause_);
        reg32(USBD_BASE, EVENTCAUSE) = eventCause_;
    }

    if (suspended_ != wasSuspended) {
        if (suspended_) {
            // Keep only wake/reset sources armed. Endpoint events stay latched
            // and are serviced after RESUME, so the IRQ cannot spin while the
            // bus is inactive and no EasyDMA work starts from stale active state.
            reg32(USBD_BASE, INTENCLR) =
                USBD_ACTIVE_INTERRUPT_MASK & ~USBD_SUSPEND_INTERRUPT_MASK;
        } else {
            reg32(USBD_BASE, INTENSET) = USBD_ACTIVE_INTERRUPT_MASK;
        }
    }
    if (suspended_) {
        return;
    }

    if (reg32(USBD_BASE, EVENTS_STARTED) != 0UL) {
        reg32(USBD_BASE, EVENTS_STARTED) = 0UL;
        started_ = true;
    }

    if (reg32(USBD_BASE, eventEndEpinOffset(0U)) != 0UL) {
        reg32(USBD_BASE, eventEndEpinOffset(0U)) = 0UL;
        completePendingAddress();
    }

    if (reg32(USBD_BASE, eventEndEpinOffset(SERVICE_NOTIFICATION_EP)) != 0UL) {
        reg32(USBD_BASE, eventEndEpinOffset(SERVICE_NOTIFICATION_EP)) = 0UL;
        // DMA-to-endpoint finished. Keep the notification busy until the host
        // ACK appears in EPDATASTATUS, otherwise a second notification can
        // overwrite the endpoint FIFO before usbser reads the first.
        diagResetAtUsbdBeginStage(21UL);
    }

