dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
    if (userPortEnabled() && reg32(USBD_BASE, eventEndEpinOffset(USER_NOTIFICATION_EP)) != 0UL) {
        reg32(USBD_BASE, eventEndEpinOffset(USER_NOTIFICATION_EP)) = 0UL;
    }

    const bool ep0SetupPending = reg32(USBD_BASE, EVENTS_EP0SETUP) != 0UL;
    if (ep0DataDoneMayCommit(ep0SetupPending) &&
        reg32(USBD_BASE, EVENTS_EP0DATADONE) != 0UL) {
        reg32(USBD_BASE, EVENTS_EP0DATADONE) = 0UL;
        if (pollTraceEnabled()) {
            ++g_usbdPollTrace.ep0DataDoneEvents;
        }
        // Route EP0DATADONE from our admitted transfer state, never from the
        // volatile BMREQUESTTYPE register. That register describes the latest
        // SETUP token rather than serving as a completion tag; the co-latched
        // newer-SETUP case was rejected above as an abort.
        const bool inXferActive =
            ep0InXferPhase_ == Ep0InXferPhase::Data ||
            ep0InXferPhase_ == Ep0InXferPhase::StatusPending;
        const bool outXferActive = pendingControlOut_ != ControlOutTransfer::None;
        if (inXferActive) {
            if (ep0InXferPhase_ == Ep0InXferPhase::StatusPending) {
                ep0InXferPhase_ = Ep0InXferPhase::Idle;
            } else if (ep0InXferPhase_ == Ep0InXferPhase::Data) {
                sendEp0ControlInChunkOrAdvanceStatus();
            }
        } else if (outXferActive) {
            // CRITICAL: EP0DATADONE only signals that the host-to-device data has been
            // accepted INTO THE PERIPHERAL'S INTERNAL BUFFER. It does NOT mean the
            // bytes are in our RAM controlOutBuffer_ yet. Per nRF52840 PS section
            // 6.36.6 (USBD EasyDMA model), the firmware must trigger TASKS_STARTEPOUT[0]
            // to EasyDMA the bytes out of the peripheral into PTR, and only then will
            // EVENTS_ENDEPOUT[0] (+ EPOUT[0].AMOUNT) reflect the actual byte count.
            // Without this step, AMOUNT stays 0, completeControlOutTransfer reads a
            // zero length, and the exact seven-byte guard inside the
            // ServiceLineCoding case drops the entire SET_LINE_CODING payload — which
            // is precisely why the device's baud was stuck at its 115200 default and
            // the 1200 bps touch never armed.
            if (triggerEndpointStartTask(taskStartEpoutOffset(0U))) {
                completeControlOutTransfer();
                completePendingAddress();
            } else {
                // A bounded EasyDMA failure must not leave EP0 permanently
                // owned by a stale control-OUT transfer. Abort this request and
                // let the host recover through the normal control-pipe retry.
                pendingControlOut_ = ControlOutTransfer::None;
                controlOutExpected_ = 0U;
                controlOutLength_ = 0U;
                stallControlEndpoint();
            }
        }
        // Else: spurious EP0DATADONE with neither side tracked — drop silently.
    }

    // A newer SETUP aborts the old data/status stage. If both events are
    // latched, discard the old DONE before serviceSetup() creates state for the
    // new request; otherwise the stale completion could advance or commit the
    // new transfer (including an aborted 1200-baud line-coding request).
    if (ep0SetupPending) {
        if (reg32(USBD_BASE, EVENTS_EP0DATADONE) != 0UL) {
            reg32(USBD_BASE, EVENTS_EP0DATADONE) = 0UL;
            if (pollTraceEnabled()) {
                ++g_usbdPollTrace.ep0DataDoneEvents;
            }
        }
        reg32(USBD_BASE, EVENTS_EP0SETUP) = 0UL;
        if (pollTraceEnabled()) {
            ++g_usbdPollTrace.ep0SetupEvents;
        }
        diagResetAtUsbdBeginStage(7UL);
        serviceSetup();
        diagResetAtUsbdBeginStage(8UL);
    }

    // A host OUT packet has been buffered when its EPDATASTATUS OUT bit is set
    // (EPOUT1..7 = bits 17..23); for each we serialize an EasyDMA STARTEPOUT,
    // then copy the completed packet into its software RX ring.
    //
    // We drain straight from EPDATASTATUS rather than gating on EVENTS_EPDATA.
    // EVENTS_EPDATA is only an aggregate "a data endpoint advanced" wake. The
    // GDB stub services USB by busy-polling this handler (USBD IRQ masked while
    // halted) thousands of times faster than the ISR would, and that polling
    // can sample EVENTS_EPDATA in the brief window *before* the per-endpoint
    // OUT bit latches in EPDATASTATUS — or after a prior pass already cleared
    // the aggregate event. Gating the drain on EVENTS_EPDATA then strands the
    // received packet in the endpoint's internal buffer with its EPDATASTATUS
    // bit stuck set, so every subsequent OUT is NAK'd and host writes time out.
    // (This never bit the normal USBD ISR because interrupt latency lets
    // EPDATASTATUS latch before the handler reads it.) Reading EPDATASTATUS
    // directly each pass recovers any such packet on the very next poll. This
    // was the real cause of the "service CDC OUT NAKs while the stub is halted"
    // bug — the GDB stub is the first feature to receive bulk OUT on the
    // service CDC, so the latent busy-poll race finally surfaced.
    // EPDATA fires when a data endpoint advances. Use it for the IN-side ACK:
    // EPDATASTATUS.EPIN<n> sets when the HOST has read an IN packet. Clear the
    // in-flight flag on THAT, not on EVENTS_ENDEPIN below — ENDEPIN only means
    // the buffer->FIFO DMA finished; the packet still sits in the endpoint FIFO
    // until the host reads it, and STARTEPIN'ing the next chunk before then
    // overwrites the unread FIFO and drops the chunk. That silently truncated
    // multi-packet IN replies (e.g. the GDB qSupported feature list lost its
    // first 64-byte chunk, leaving "$+#ad"). Clear only the IN bits here; the
    // OUT bits (EPOUT2/EPOUT4) belong to drainServiceDataOut().
    // EPDATA is only an aggregate wake event. Its flag can be consumed just
    // before a per-endpoint ACK bit latches, so inspect the endpoint status on
    // every pass and recover a CDC IN transfer even when that aggregate edge
    // was missed during a bootloader-to-application handoff.
    uint32_t endpointStatus = reg32(USBD_BASE, EPDATASTATUS);
    {
        // On this silicon the aggregate EPDATA event can become visible a few
        // peripheral clocks before its endpoint-status bit. Briefly resample;
        // if it is still zero, leave EPDATA asserted so the IRQ is retriggered
        // instead of losing the only wake-up for the next queued IN packet.
        if (reg32(USBD_BASE, EVENTS_EPDATA) != 0UL && endpointStatus == 0UL) {
            for (uint32_t spin = 0UL; spin < 64UL && endpointStatus == 0UL; ++spin) {
                endpointStatus = reg32(USBD_BASE, EPDATASTATUS);
            }
        }
        const uint32_t serviceNotificationAck = 1UL << SERVICE_NOTIFICATION_EP;
        const uint32_t serviceInAck = 1UL << SERVICE_DATA_EP;
        const uint32_t userNotificationAck = 1UL << USER_NOTIFICATION_EP;
        const uint32_t userInAck = 1UL << USER_DATA_EP;
        uint32_t handledInAck = 0UL;
        if ((endpointStatus & serviceNotificationAck) != 0UL) {
            notificationInFlight_ = false;
            handledInAck |= serviceNotificationAck;
        }
        if ((endpointStatus & serviceInAck) != 0UL) {
            if (dataInFlight_) {
                txTail_ = (txTail_ + dataInFlightLength_) % USBD_RING_BUFFER_SIZE;
            }
            dataInFlightLength_ = 0U;
            dataInFlight_ = false;
            handledInAck |= serviceInAck;
        }
        if (userPortEnabled()) {
            if ((endpointStatus & userNotificationAck) != 0UL) {
                userNotificationInFlight_ = false;
                handledInAck |= userNotificationAck;
            }
            if ((endpointStatus & userInAck) != 0UL) {
                if (userDataInFlight_) {
                    userTxTail_ = (userTxTail_ + userDataInFlightLength_) % USBD_RING_BUFFER_SIZE;
                }
                userDataInFlightLength_ = 0U;
                userDataInFlight_ = false;
                handledInAck |= userInAck;
            }
        }
        for (uint8_t endpoint = firstDynamicEndpoint(); endpoint < USB_MAX_ENDPOINTS; ++endpoint) {
            const uint32_t dynamicInAck = 1UL << endpoint;
            if ((endpointStatus & dynamicInAck) != 0UL) {
                if (dynamicInBusy_[endpoint]) {
                    dynamicInBusy_[endpoint] = false;
                    dynamicInLengths_[endpoint] = 0U;
                    PluggableUSB().endpointInComplete(endpoint);
                }
                handledInAck |= dynamicInAck;
            }
        }
        if (handledInAck != 0UL) {
            reg32(USBD_BASE, EPDATASTATUS) = handledInAck;
        }
    }

    if (reg32(USBD_BASE, EVENTS_EPDATA) != 0UL) {
        reg32(USBD_BASE, EVENTS_EPDATA) = 0UL;
        // OUT packets remain pending until foreground pumpRx() or the halted
        // GDB loop has ring capacity and consumes the exact endpoint-status
        // bit. Keeping data reception out of this aggregate-event cleanup also
        // preserves backpressure and avoids competing EasyDMA launches.
    }

    if (reg32(USBD_BASE, eventEndEpoutOffset(SERVICE_DATA_EP)) != 0UL) {
        // OUT packets are consumed through their EPDATASTATUS bit by pumpRx().
        // The synchronous DMA scheduler deliberately leaves ENDEPOUT latched
        // for this common event-cleanup path; the bytes were already copied.
        reg32(USBD_BASE, eventEndEpoutOffset(SERVICE_DATA_EP)) = 0UL;
    }

    if (reg32(USBD_BASE, eventEndEpinOffset(SERVICE_DATA_EP)) != 0UL) {
        // DMA buffer->FIFO done; the host-read ACK (EPDATASTATUS.EPIN2 above)
        // is what frees us to send the next chunk, so don't clear dataInFlight_.
        reg32(USBD_BASE, eventEndEpinOffset(SERVICE_DATA_EP)) = 0UL;
        diagResetAtUsbdBeginStage(18UL);
    }

    if (userPortEnabled() && reg32(USBD_BASE, eventEndEpoutOffset(USER_DATA_EP)) != 0UL) {
        reg32(USBD_BASE, eventEndEpoutOffset(USER_DATA_EP)) = 0UL; // clear-only, see above
    }

    if (userPortEnabled() && reg32(USBD_BASE, eventEndEpinOffset(USER_DATA_EP)) != 0UL) {
        reg32(USBD_BASE, eventEndEpinOffset(USER_DATA_EP)) = 0UL;
    }

    for (uint8_t endpoint = firstDynamicEndpoint(); endpoint < USB_MAX_ENDPOINTS; ++endpoint) {
        if (reg32(USBD_BASE, eventEndEpinOffset(endpoint)) != 0UL) {
            reg32(USBD_BASE, eventEndEpinOffset(endpoint)) = 0UL;
        }
    }

