dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
}

bool NrfUsbdDriver::enabled() const {
    return enabled_;
}

bool NrfUsbdDriver::attached() const {
    return enabled_ && attached_;
}

bool NrfUsbdDriver::ready() const {
    return attached_ && ready_;
}

bool NrfUsbdDriver::connected() const {
    return enabled_ && attached_ && ready_ && configured_ && !suspended_ &&
        vbusDetected() && dtr_ && dtrAssertedMillis_ != 0UL &&
        (millis() - dtrAssertedMillis_) >= USBD_CDC_OPEN_SETTLE_MS;
}

void NrfUsbdDriver::serviceTouchTimer() {
    if (!serviceTouchPending_) {
        return;
    }

    const bool resetArmed = configuredMillis_ != 0UL &&
        (millis() - configuredMillis_) >= USBD_1200_RESET_ARM_MS;
    const bool windowStarted = serviceTouchResetMillis_ != 0UL;
    const bool windowElapsed = windowStarted &&
        (millis() - serviceTouchResetMillis_) >= USBD_TOUCH_RESET_CONFIRM_MS;
    const bool inConfirmWindow = windowStarted && !windowElapsed;

    if (windowElapsed) {
        // The 1200-bps line coding plus DTR drop is already explicit host intent.
        // Do not re-check DTR: usbser may reassert it while closing the handle.
        serviceTouchPending_ = false;
        serviceTouchResetMillis_ = 0UL;
        if (ignoredResetTouchCount_ < USBD_IGNORE_INITIAL_1200_RESET_COUNT) {
            ++ignoredResetTouchCount_;
        } else {
            markResetCause(USBD_DIAG_CAUSE_1200_TOUCH);
            requestBootloaderReset();
        }
        return;
    }

    if (!configured_ || (dtr_ && !inConfirmWindow) ||
        (!windowStarted && lineCoding_.baudRate != 1200UL)) {
        serviceTouchPending_ = false;
        serviceTouchResetMillis_ = 0UL;
    } else if (!resetArmed) {
        serviceTouchResetMillis_ = 0UL;
    } else if (!windowStarted) {
        serviceTouchResetMillis_ = millis();
    }
}

void NrfUsbdDriver::serviceDetachTimer() {
    if (detachRequestMagic_ != USBD_DETACH_REQUEST_MAGIC ||
        (millis() - detachRequestedMillis_) < USBD_DFU_DETACH_RESET_DELAY_MS) {
        return;
    }
    const uint32_t cause = detachCause_;
    detachRequestMagic_ = 0UL;
    detachCause_ = 0UL;
    detachRequestedMillis_ = 0UL;
    diagResetAtUsbdBeginStage(22UL);
    if (cause != 0UL) {
        markResetCause(cause);
        requestBootloaderReset();
    }
}

void NrfUsbdDriver::serviceTick() {
    // USB startup/restart must not depend on loop()/yield(). Advance exactly one
    // bounded state-machine step per tick so cable insertion recovers even
    // while application code continuously occupies the foreground.
    if (!enabled_) {
        serviceStartup();
        return;
    }
    // The nRF POWER block owns the VBUS edge, but claiming POWER_CLOCK IRQ
    // would collide with radio/clock stacks. SysTick is explicitly lower
    // priority than USBD, so this 1 kHz observation cannot preempt the USB ISR
    // and safely retires stale endpoint/controller state without depending on
    // foreground yield(). The pending logical start request then follows the
    // normal startup state machine when VBUS returns.
    if (!vbusDetected()) {
        processBusState(false);
        return;
    }
    if (stubHalted_) {
        return;
    }
    serviceTouchTimer();
    serviceDetachTimer();
}

bool NrfUsbdDriver::userConnected() const {
    return enabled_ && attached_ && ready_ && configured_ && !suspended_ &&
        vbusDetected() && userPortEnabled() && userDtr_ &&
        userDtrAssertedMillis_ != 0UL &&
        (millis() - userDtrAssertedMillis_) >= USBD_CDC_OPEN_SETTLE_MS;
}

bool NrfUsbdDriver::configured() const {
    return attached_ && configured_;
}

bool NrfUsbdDriver::suspended() const {
    return attached_ && suspended_;
}

bool NrfUsbdDriver::dtr() const {
    return dtr_;
}

bool NrfUsbdDriver::rts() const {
    return rts_;
}

bool NrfUsbdDriver::userDtr() const {
    return userDtr_;
}

bool NrfUsbdDriver::userRts() const {
    return userRts_;
}

unsigned long NrfUsbdDriver::baud() const {
    return lineCoding_.baudRate;
}

unsigned long NrfUsbdDriver::userBaud() const {
    return userLineCoding_.baudRate;
}

uint8_t NrfUsbdDriver::address() const {
    return address_;
}

uint8_t NrfUsbdDriver::configuration() const {
    return configuration_;
}

const NrfUsbLineCoding &NrfUsbdDriver::lineCoding() const {
    return lineCoding_;
}

const NrfUsbLineCoding &NrfUsbdDriver::userLineCoding() const {
    return userLineCoding_;
}

int NrfUsbdDriver::available() const {
    return static_cast<int>(ringPending(rxHead_, rxTail_));
}

int NrfUsbdDriver::peek() const {
    return ringPeekRx();
}

int NrfUsbdDriver::read() {
    return ringPopRx();
}

size_t NrfUsbdDriver::write(uint8_t value) {
    UsbdIrqLock lock;
    processBusState(vbusDetected());
    if (!ringPushTx(value)) {
        return 0U;
    }
    if (configured_ && !suspended_) {
        serviceDataIn(false);
    }
    return 1U;
}

void NrfUsbdDriver::kickServiceDataIn() {
    if (!enabled_ || !configured_ || suspended_) {
        return;
    }
    UsbdIrqLock lock;
    serviceDataIn(false);
    serviceNotificationIn(false);
}

void NrfUsbdDriver::pumpRx() {
    if (!enabled_ || !configured_ || suspended_) {
        return;
    }
    UsbdIrqLock lock;

    // Recover any IN acknowledgement whose aggregate interrupt arrived before
    // EPDATASTATUS latched. Serial.available()/read() are foreground progress
    // points too, so a busy sketch cannot strand the following TX packet.
    processBusState(vbusDetected());

    drainServiceDataOut();
}

bool NrfUsbdDriver::sendInPacket(uint8_t endpoint, const void *data, size_t length) {
    if (!enabled_ || !attached_ || !configured_ || suspended_ ||
        (data == nullptr && length != 0U)) {
        return false;
    }
    if (endpoint < firstDynamicEndpoint() || endpoint >= USB_MAX_ENDPOINTS) {
        return false;
    }
    uint8_t endpointAttributes = 0U;
    if (!endpointDescriptorAttributes(epAddressIn(endpoint), endpointAttributes)) {
        // A module cannot transmit through an endpoint number it did not
        // actually admit as IN in the active configuration descriptor.
        return false;
    }
    (void)endpointAttributes;

    // Hold the busy test-and-set plus the EasyDMA kick atomic against the ISR,
    // which clears dynamicInBusy_[endpoint] after the host's IN ACK.
    UsbdIrqLock lock;
    if (ep0InXferPhase_ != Ep0InXferPhase::Idle ||
        pendingControlOut_ != ControlOutTransfer::None) {
        return false;
    }
    if (dynamicInBusy_[endpoint]) {
        return false;
    }

    if (length > DATA_EP_MAX_PACKET) {
        // The pluggable API represents one USB packet and returns only a bool;
        // truncating would falsely report the caller's complete payload sent.
        return false;
    }
    const size_t actualLength = length;
    const uint8_t *source = reinterpret_cast<const uint8_t *>(data);
    for (size_t index = 0; index < actualLength; ++index) {
        dynamicInBuffers_[endpoint][index] = source[index];
    }
    dynamicInLengths_[endpoint] = static_cast<uint8_t>(actualLength);
    const uint32_t enabledIn = reg32(USBD_BASE, EPINEN);
    if ((enabledIn & endpointMask(endpoint)) == 0U) {
        reg32(USBD_BASE, EPINEN) = enabledIn | endpointMask(endpoint);
        resetEndpointDataState(epAddressIn(endpoint));
    }
    reg32(USBD_BASE, epinPtrOffset(endpoint)) = reinterpret_cast<uint32_t>(&dynamicInBuffers_[endpoint][0]);
    reg32(USBD_BASE, epinMaxcntOffset(endpoint)) = static_cast<uint32_t>(actualLength);
    if (!triggerEndpointStartTask(taskStartEpinOffset(endpoint))) {
        dynamicInLengths_[endpoint] = 0U;
        return false;
    }
    dynamicInBusy_[endpoint] = true;
    return true;
}

void NrfUsbdDriver::flush() {
    if (!enabled_ || !configured_ || suspended_) {
        return;
    }

    // The drain loop calls processBusState()/serviceDataIn() itself, so keep the
    // whole pass mutually exclusive with the ISR; events that arrive meanwhile
    // latch and are taken the moment we return and unmask.
    UsbdIrqLock lock;

    if (stubHalted_) {
        // While the GDB stub is halted SysTick is stopped, so millis() is
        // FROZEN — the normal millis()-based 50 ms bound below never trips and
        // flush() would spin for tens of seconds (gdb then times out before the
        // reply lands). Bound the drain with a spin counter instead, pumping the
        // OUT/IN service path (processBusState advances IN ENDEPIN, serviceDataIn
        // starts the next chunk) until the tx ring is empty or the link drops.
        for (uint32_t spin = 0UL; spin < USBD_STUB_FLUSH_SPINS; ++spin) {
            if ((txPending() == 0U && !dataInFlight_) || !enabled_) {
                break;
            }
            if (!configured_ || suspended_ || !vbusDetected()) {
                break;
            }
            processBusState(vbusDetected());
            serviceDataIn(false);
        }
        return;
    }

    const uint32_t start = millis();
    while ((txPending() != 0U || dataInFlight_) && enabled_) {
        processBusState(vbusDetected());
        serviceDataIn(false);
        if (!configured_ || suspended_ || !vbusDetected()) {
            break;
        }
        if ((millis() - start) >= 50UL) {
            break;
        }
    }
}

void NrfUsbdDriver::injectRx(const uint8_t *data, size_t length) {
    if (data == nullptr) {
        return;
    }

    // serviceDataOut() (ISR) is the other producer into the service RX ring;
    // serialize so the two producers never interleave a head update.
    UsbdIrqLock lock;
    for (size_t index = 0; index < length; ++index) {
        ringPushRx(data[index]);
    }
}

void NrfUsbdDriver::setLineCoding(const NrfUsbLineCoding &lineCoding) {
    lineCoding_ = lineCoding;
}

void NrfUsbdDriver::setLineState(bool dtr, bool rts) {
    if (dtr && !dtr_) {
        dtrAssertedMillis_ = millis();
    } else if (!dtr) {
        dtrAssertedMillis_ = 0UL;
    }
    dtr_ = dtr;
    rts_ = rts;
}

int NrfUsbdDriver::userAvailable() const {
    return static_cast<int>(ringPending(userRxHead_, userRxTail_));
}

int NrfUsbdDriver::userPeek() const {
    return userRingPeekRx();
}

int NrfUsbdDriver::userRead() {
    return userRingPopRx();
}

size_t NrfUsbdDriver::userWrite(uint8_t value) {
    UsbdIrqLock lock;
    processBusState(vbusDetected());
    if (!userPortEnabled() || !userRingPushTx(value)) {
        return 0U;
    }
    if (configured_ && !suspended_) {
        serviceDataIn(true);
    }
    return 1U;
}

