dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
size_t NrfUsbdDriver::userWrite(const uint8_t *data, size_t length) {
    if (!userPortEnabled() || data == nullptr) {
        return 0U;
    }
    // SPSC ring: the foreground is the sole producer, the ISR drains (consumer),
    // so userRingPushTx() is safe lock-free here (same as the per-byte path).
    UsbdIrqLock lock;
    processBusState(vbusDetected());
    size_t written = 0U;
    while (written < length && userRingPushTx(data[written])) {
        ++written;
    }
    if (written > 0U && configured_ && !suspended_) {
        serviceDataIn(true);  // arm once for the whole block (was once per byte)
    }
    return written;
}

void NrfUsbdDriver::userFlush() {
    if (!userPortEnabled() || !enabled_ || !configured_ || suspended_) {
        return;
    }

    UsbdIrqLock lock;
    const uint32_t start = millis();
    while ((userTxPending() != 0U || userDataInFlight_) && enabled_) {
        processBusState(vbusDetected());
        serviceDataIn(true);
        if (!configured_ || suspended_ || !vbusDetected()) {
            break;
        }
        if ((millis() - start) >= 50UL) {
            break;
        }
    }
}

void NrfUsbdDriver::setUserLineCoding(const NrfUsbLineCoding &lineCoding) {
    userLineCoding_ = lineCoding;
}

void NrfUsbdDriver::setUserLineState(bool dtr, bool rts) {
    if (dtr && !userDtr_) {
        userDtrAssertedMillis_ = millis();
    } else if (!dtr) {
        userDtrAssertedMillis_ = 0UL;
    }
    userDtr_ = dtr;
    userRts_ = rts;
}

NrfUsbdStatus NrfUsbdDriver::status() const {
    return {enabled_, started_, attached_, vbusDetected(), ready_, configured_, suspended_, cdcActive_, address_, configuration_, eventCause_};
}

void NrfUsbdDriver::resetConnectionState() {
    // NOTE: do NOT clear ready_ here. ready_ reflects the USBD *peripheral*
    // readiness after ENABLE (the one-shot EVENTCAUSE.READY observed in begin()),
    // not the USB *bus* connection. resetConnectionState() runs on every USB bus
    // reset (which the host issues during normal enumeration); clearing ready_
    // there left it false forever - begin() consumes the READY event, so the
    // processBusState path that sets ready_ never fires again - so
    // USBDevice.connected() never returned true and any sketch that waits on it
    // (e.g. the GDB-stub debug example) hung before reaching the breakpoint.
    // ready_ is owned by begin() (set true) and end() (set false).
    configured_ = false;
    suspended_ = false;
    cdcActive_ = false;
    dataInFlight_ = false;
    dataInFlightLength_ = 0U;
    notificationInFlight_ = false;
    notificationPending_ = false;
    userDataInFlight_ = false;
    userDataInFlightLength_ = 0U;
    userNotificationInFlight_ = false;
    userNotificationPending_ = false;
    dtr_ = false;
    rts_ = false;
    dtrAssertedMillis_ = 0UL;
    userDtr_ = false;
    userRts_ = false;
    userDtrAssertedMillis_ = 0UL;
    lineCoding_ = {115200UL, 0U, 0U, 8U};
    userLineCoding_ = {115200UL, 0U, 0U, 8U};
    pendingAddressValid_ = false;
    pendingControlOut_ = ControlOutTransfer::None;
    controlOutExpected_ = 0U;
    controlOutLength_ = 0U;
    detachRequestMagic_ = 0UL;
    detachCause_ = 0UL;
    detachRequestedMillis_ = 0UL;
    resetEp0InXferState();
    serviceTouchPending_ = false;
    serviceTouchResetMillis_ = 0UL;
    serviceSaw1200Millis_ = 0UL;
    ignoredResetTouchCount_ = 0U;
    address_ = 0U;
    pendingAddress_ = 0U;
    configuration_ = 0U;
    haltedInEndpoints_ = 0U;
    haltedOutEndpoints_ = 0U;
    configStartMillis_ = (enabled_ && attached_) ? millis() : 0UL;
    configuredMillis_ = 0UL;
    serialStateBitmap_ = 0U;
    userSerialStateBitmap_ = 0U;
    if (enabled_) {
        reg32(USBD_BASE, EPINEN) = endpointMask(0U);
        reg32(USBD_BASE, EPOUTEN) = endpointMask(0U);
    }
    resetDynamicEndpoints();
}

void NrfUsbdDriver::resetDynamicEndpoints() {
    for (uint8_t endpoint = 0U; endpoint < USB_MAX_ENDPOINTS; ++endpoint) {
        dynamicInLengths_[endpoint] = 0U;
        dynamicInBusy_[endpoint] = false;
    }
}

bool NrfUsbdDriver::initDescriptors() {
    const NrfSystemProfile &profile = nrfSystemProfile();
    const uint8_t deviceDescriptor[] = {
        18U, USB_DESC_DEVICE,
        0x00U, 0x02U,
        0xEFU, 0x02U, 0x01U,
        static_cast<uint8_t>(CONTROL_EP_MAX_PACKET),
        static_cast<uint8_t>(profile.usbVid & 0xFFU), static_cast<uint8_t>((profile.usbVid >> 8U) & 0xFFU),
        static_cast<uint8_t>(profile.usbPid & 0xFFU), static_cast<uint8_t>((profile.usbPid >> 8U) & 0xFFU),
        0x00U, 0x01U,
        0x01U, 0x02U, 0x03U,
        0x01U
    };

    for (size_t index = 0; index < sizeof(deviceDescriptor); ++index) {
        deviceDescriptor_[index] = deviceDescriptor[index];
    }

    configurationDescriptorLength_ = 0U;
    bool baseDescriptorValid = true;
    const auto appendDescriptor = [&](const uint8_t *data, size_t length) {
        if (length > (sizeof(configurationDescriptor_) - configurationDescriptorLength_)) {
            baseDescriptorValid = false;
            return;
        }
        for (size_t index = 0; index < length; ++index) {
            configurationDescriptor_[configurationDescriptorLength_++] = data[index];
        }
    };
    const auto appendCdcDescriptor =
        [&](uint8_t controlInterface,
            uint8_t dataInterface,
            uint8_t notificationEndpoint,
            uint8_t dataEndpoint,
            uint8_t controlStringIndex,
            uint8_t dataStringIndex) {
        const uint8_t descriptor[] = {
            0x08U, USB_DESC_IAD, controlInterface, 0x02U, 0x02U, 0x02U, 0x01U, controlStringIndex,
            0x09U, USB_DESC_INTERFACE, controlInterface, 0x00U, 0x01U, 0x02U, 0x02U, 0x01U, controlStringIndex,
            0x05U, USB_DESC_CS_INTERFACE, 0x00U, 0x10U, 0x01U,
            0x05U, USB_DESC_CS_INTERFACE, 0x01U, 0x00U, dataInterface,
            0x04U, USB_DESC_CS_INTERFACE, 0x02U, 0x02U,
            0x05U, USB_DESC_CS_INTERFACE, 0x06U, controlInterface, dataInterface,
            0x07U, USB_DESC_ENDPOINT, epAddressIn(notificationEndpoint), 0x03U, 0x10U, 0x00U, 0x10U,
            0x09U, USB_DESC_INTERFACE, dataInterface, 0x00U, 0x02U, 0x0AU, 0x00U, 0x00U, dataStringIndex,
            0x07U, USB_DESC_ENDPOINT, epAddressOut(dataEndpoint), 0x02U, 0x40U, 0x00U, 0x00U,
            0x07U, USB_DESC_ENDPOINT, epAddressIn(dataEndpoint), 0x02U, 0x40U, 0x00U, 0x00U,
        };
        appendDescriptor(descriptor, sizeof(descriptor));
    };
    const uint8_t configHeader[] = {
        0x09U, USB_DESC_CONFIGURATION, 0x00U, 0x00U, 0x00U, 0x01U, 0x00U, 0x80U, 0x32U,
    };
    appendDescriptor(configHeader, sizeof(configHeader));
    appendCdcDescriptor(SERVICE_CONTROL_INTERFACE,
                        SERVICE_DATA_INTERFACE,
                        SERVICE_NOTIFICATION_EP,
                        SERVICE_DATA_EP,
                        USB_STRING_SERVICE_CONTROL,
                        USB_STRING_SERVICE_DATA);
    uint8_t interfaceCount = 2U;
    if (userPortEnabled()) {
        appendCdcDescriptor(USER_CONTROL_INTERFACE,
                            USER_DATA_INTERFACE,
                            USER_NOTIFICATION_EP,
                            USER_DATA_EP,
                            USB_STRING_USER_CONTROL,
                            USB_STRING_USER_DATA);
        interfaceCount = 4U;
    }
#if !defined(NRF_USB_RUNTIME_DISABLE_APP_DFU) || (NRF_USB_RUNTIME_DISABLE_APP_DFU == 0)
    const uint8_t dfuDescriptor[] = {
        0x09U, USB_DESC_INTERFACE, dfuInterfaceNumber(), 0x00U, 0x00U, 0xFEU, 0x01U, 0x01U, USB_STRING_DFU,
        0x09U, USB_DESC_DFU_FUNCTIONAL, 0x0DU, 0xFFU, 0x00U, 0x00U, 0x08U, 0x1AU, 0x01U,
    };
    appendDescriptor(dfuDescriptor, sizeof(dfuDescriptor));
    ++interfaceCount;
#endif

