dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
    const size_t baseDescriptorLength = configurationDescriptorLength_;
    PluggableUSB().beginDescriptorBuild(configurationDescriptor_,
                                        sizeof(configurationDescriptor_),
                                        baseDescriptorLength);
    const int pluggableLength = PluggableUSB().getInterface(&interfaceCount);
    const size_t builtDescriptorLength = PluggableUSB().endDescriptorBuild();
    if (pluggableLength < 0 ||
        builtDescriptorLength != baseDescriptorLength + static_cast<size_t>(pluggableLength) ||
        builtDescriptorLength > sizeof(configurationDescriptor_)) {
        return false;
    }
    configurationDescriptorLength_ = static_cast<uint16_t>(builtDescriptorLength);

    configurationDescriptor_[2] = static_cast<uint8_t>(configurationDescriptorLength_ & 0xFFU);
    configurationDescriptor_[3] = static_cast<uint8_t>((configurationDescriptorLength_ >> 8U) & 0xFFU);
    configurationDescriptor_[4] = interfaceCount;
    return baseDescriptorValid && configurationDescriptorLength_ >= sizeof(configHeader);
}

void NrfUsbdDriver::clearEvents() {
    reg32(USBD_BASE, EVENTS_USBRESET) = 0UL;
    reg32(USBD_BASE, EVENTS_STARTED) = 0UL;
    for (uint8_t endpoint = 0; endpoint < 8U; ++endpoint) {
        reg32(USBD_BASE, eventEndEpinOffset(endpoint)) = 0UL;
        reg32(USBD_BASE, eventEndEpoutOffset(endpoint)) = 0UL;
    }
    reg32(USBD_BASE, EVENTS_EP0DATADONE) = 0UL;
    reg32(USBD_BASE, EVENTS_USBEVENT) = 0UL;
    reg32(USBD_BASE, EVENTS_EP0SETUP) = 0UL;
    reg32(USBD_BASE, EVENTCAUSE) = 0xFFFFFFFFUL;
}

void NrfUsbdDriver::enableInterrupts() {
    reg32(USBD_BASE, INTENSET) = USBD_ACTIVE_INTERRUPT_MASK;
    // Run USB at a low preemption priority (6 of 0..7) so genuinely
    // time-critical ISRs -- the BLE radio/timer chain in particular -- always
    // win the arbitration. USB enumeration tolerates the small added latency,
    // and the foreground critical sections (UsbdIrqLock) keep it race-free.
    setNvicPriority(USBD_IRQ_NUMBER, 6U);
    enableNvicIrq(USBD_IRQ_NUMBER);
}

void NrfUsbdDriver::disableInterrupts() {
    const uint32_t interruptMask =
        USBD_INT_USBRESET_MASK |
        USBD_INT_STARTED_MASK |
        USBD_INT_ENDEPIN0_MASK |
        USBD_INT_ENDEPIN1_MASK |
        USBD_INT_ENDEPIN2_MASK |
        USBD_INT_ENDEPIN3_MASK |
        USBD_INT_ENDEPIN4_MASK |
        USBD_INT_EP0DATADONE_MASK |
        USBD_INT_ENDEPOUT2_MASK |
        USBD_INT_ENDEPOUT4_MASK |
        USBD_INT_USBEVENT_MASK |
        USBD_INT_EP0SETUP_MASK |
        USBD_INT_EPDATA_MASK;
    reg32(USBD_BASE, INTENCLR) = interruptMask;
    disableNvicIrq(USBD_IRQ_NUMBER);
}

void NrfUsbdDriver::enablePullup(bool enabled) {
    if (enabled) {
        reg32(USBD_BASE, USBPULLUP) = 1UL;
    } else {
        reg32(USBD_BASE, USBPULLUP) = 0UL;
    }
}

void NrfUsbdDriver::startCdcEndpoints() {
    reg32(USBD_BASE, EPINEN) |= endpointMask(SERVICE_NOTIFICATION_EP) | endpointMask(SERVICE_DATA_EP);
    reg32(USBD_BASE, EPOUTEN) |= endpointMask(SERVICE_DATA_EP);
    resetEndpointDataState(epAddressIn(SERVICE_NOTIFICATION_EP));
    resetEndpointDataState(epAddressIn(SERVICE_DATA_EP));
    resetEndpointDataState(epAddressOut(SERVICE_DATA_EP));
    // A newly enabled OUT endpoint NAKs until software writes SIZE.EPOUT[n].
    // This write makes its peripheral buffer available; it does NOT start DMA.
    reg32(USBD_BASE, sizeEpoutOffset(SERVICE_DATA_EP)) = 0UL;
    if (userPortEnabled()) {
        reg32(USBD_BASE, EPINEN) |= endpointMask(USER_NOTIFICATION_EP) | endpointMask(USER_DATA_EP);
        reg32(USBD_BASE, EPOUTEN) |= endpointMask(USER_DATA_EP);
        resetEndpointDataState(epAddressIn(USER_NOTIFICATION_EP));
        resetEndpointDataState(epAddressIn(USER_DATA_EP));
        resetEndpointDataState(epAddressOut(USER_DATA_EP));
        reg32(USBD_BASE, sizeEpoutOffset(USER_DATA_EP)) = 0UL;
    }
    cdcActive_ = true;
}

void NrfUsbdDriver::fetchOutPacket(uint8_t endpoint, bool userPort, uint32_t statusBit) {
    // Called only when EPDATASTATUS.<statusBit> is already set: a COMPLETE host
    // packet is in this endpoint's FIFO (USB OUT is atomic). STARTEPOUT pulls it
    // into RAM AND re-arms the endpoint for the next OUT; we then consume the
    // data bit (W1C) and hand the bytes to the rx ring. Reading the bit BEFORE
    // (in drainServiceDataOut) avoids the race where a speculative STARTEPOUT on
    // an idle endpoint re-delivers stale FIFO content and shifts the RSP stream.
    uint8_t *buffer = userPort ? &userEndpointOutBuffer_[0] : &endpointOutBuffer_[0];
    uint32_t amount = reg32(USBD_BASE, sizeEpoutOffset(endpoint));
    if (amount > DATA_EP_MAX_PACKET) {
        amount = DATA_EP_MAX_PACKET;
    }
    reg32(USBD_BASE, epoutPtrOffset(endpoint)) = reinterpret_cast<uint32_t>(buffer);
    reg32(USBD_BASE, epoutMaxcntOffset(endpoint)) = amount;
    // Consume the current packet-ready indication BEFORE starting EasyDMA.
    // Once ENDEPOUT fires, the nRF controller may immediately ACK the next
    // host packet and re-latch this same bit. Clearing it after the DMA would
    // race that next packet and silently discard its only ready indication.
    // Nordic nrfx and TinyUSB both clear EPDATASTATUS before STARTEPOUT for
    // this reason.
    reg32(USBD_BASE, EPDATASTATUS) = statusBit;
    if (triggerEndpointStartTask(taskStartEpoutOffset(endpoint))) {
        if (amount != 0UL) {
            serviceDataOut(userPort, amount);
        }
        // After ENDEPOUT, hardware automatically accepts the next bulk OUT.
        // SIZE.EPOUT is written only when initially opening/resetting an OUT
        // endpoint. Writing it here can erase a packet accepted immediately
        // after the DMA, which appears as a one-byte loss in sustained duplex
        // streams.
    }
}

void NrfUsbdDriver::drainServiceDataOut() {
    if (!enabled_) {
        return;
    }
    // Bit-gated: STARTEPOUT only an endpoint whose OUT data bit is already set
    // (a whole packet arrived). The fetch re-arms for the next packet, so the
    // endpoint stays ready without a racy speculative re-arm. Both CDCs that
    // share this cable — service (GDB) and user (sketch Serial) — are handled so
    // a serial monitor on the user port can't wedge OUT while halted.
    const uint32_t eds = reg32(USBD_BASE, EPDATASTATUS);
    const uint32_t serviceOutBit = 1UL << (EPDATASTATUS_OUT_BASE_BIT + SERVICE_DATA_EP - 1U);
    const uint32_t userOutBit = 1UL << (EPDATASTATUS_OUT_BASE_BIT + USER_DATA_EP - 1U);
    // Preserve USB backpressure. Fetching a packet acknowledges the endpoint;
    // If the software ring cannot hold the entire packet, leave the status bit
    // pending (and the endpoint NAKing the next packet) until the sketch drains
    // enough space. SIZE.EPOUT is stable while that packet is buffered, so use
    // its exact bounded length instead of requiring an unnecessary full 64-byte
    // slot for a short packet or ZLP.
    const size_t serviceFree = (USBD_RING_BUFFER_SIZE - 1U) - ringPending(rxHead_, rxTail_);
    const size_t userFree = (USBD_RING_BUFFER_SIZE - 1U) - ringPending(userRxHead_, userRxTail_);
    const size_t servicePacket = reg32(USBD_BASE, sizeEpoutOffset(SERVICE_DATA_EP));
    const size_t userPacket = userPortEnabled()
        ? reg32(USBD_BASE, sizeEpoutOffset(USER_DATA_EP))
        : 0U;
    if ((eds & serviceOutBit) != 0UL &&
        rxRingCanAcceptPacket(serviceFree, servicePacket)) {
        fetchOutPacket(SERVICE_DATA_EP, false, serviceOutBit);
    }
    if (userPortEnabled() && (eds & userOutBit) != 0UL &&
        rxRingCanAcceptPacket(userFree, userPacket)) {
        fetchOutPacket(USER_DATA_EP, true, userOutBit);
    }
}

