dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
void NrfUsbdDriver::serviceDataOut(bool userPort, uint32_t received) {
    uint8_t *buffer = userPort ? &userEndpointOutBuffer_[0] : &endpointOutBuffer_[0];
    // NOTE: the caller passes the packet length read from SIZE.EPOUT[n]. The
    // EPOUT[n].AMOUNT register is NOT usable for this on the verified clone:
    // it reports MAXCNT (64) regardless of the real packet size, which made
    // every short host packet arrive padded with stale buffer bytes (the
    // long-standing "phantom replay" junk).
    for (uint32_t index = 0; index < received && index < DATA_EP_MAX_PACKET; ++index) {
        if (userPort) {
            userRingPushRx(buffer[index]);
        } else {
            markResetCauseIfUnset(USBD_DIAG_CAUSE_SERVICE_DATA_RX);
            ringPushRx(buffer[index]);
        }
    }
    // The next DMA starts only after EPDATASTATUS reports another complete OUT
    // packet. Never issue a speculative STARTEPOUT on an empty endpoint.
}

void NrfUsbdDriver::serviceDataIn(bool userPort) {
    if (suspended_ || ep0InXferPhase_ != Ep0InXferPhase::Idle ||
        pendingControlOut_ != ControlOutTransfer::None) {
        return;
    }
    volatile bool &dataInFlight = userPort ? userDataInFlight_ : dataInFlight_;
    volatile uint8_t &dataInFlightLength =
        userPort ? userDataInFlightLength_ : dataInFlightLength_;
    const bool dtr = userPort ? userDtr_ : dtr_;
    const uint32_t dtrAssertedMillis = userPort ? userDtrAssertedMillis_ : dtrAssertedMillis_;
    if (!dtr || dtrAssertedMillis == 0UL ||
        (millis() - dtrAssertedMillis) < USBD_CDC_OPEN_SETTLE_MS) {
        return;
    }
    if (!configured_ || dataInFlight || (userPort ? userTxPending() : txPending()) == 0U) {
        return;
    }

    uint8_t *txBuffer = userPort ? &userTxBuffer_[0] : &this->txBuffer_[0];
    volatile size_t &txHead = userPort ? userTxHead_ : txHead_;
    const size_t txTail = userPort ? userTxTail_ : txTail_;
    uint8_t *endpointBuffer = userPort ? &userEndpointInBuffer_[0] : &endpointInBuffer_[0];
    const uint8_t endpoint = userPort ? USER_DATA_EP : SERVICE_DATA_EP;
    size_t cursor = txTail;
    size_t count = 0U;
    while (count < DATA_EP_MAX_PACKET && cursor != txHead) {
        endpointBuffer[count++] = txBuffer[cursor];
        cursor = (cursor + 1U) % USBD_RING_BUFFER_SIZE;
    }

    if (count == 0U) {
        return;
    }

    if (!userPort) {
        diagResetAtUsbdBeginStage(16UL);
    }
    reg32(USBD_BASE, epinPtrOffset(endpoint)) = reinterpret_cast<uint32_t>(endpointBuffer);
    reg32(USBD_BASE, epinMaxcntOffset(endpoint)) = static_cast<uint32_t>(count);
    if (!triggerEndpointStartTask(taskStartEpinOffset(endpoint))) {
        return;
    }
    dataInFlightLength = static_cast<uint8_t>(count);
    dataInFlight = true;
    if (!userPort) {
        diagResetAtUsbdBeginStage(17UL);
    }
}

void NrfUsbdDriver::serviceNotificationIn(bool userPort) {
    if (suspended_ || ep0InXferPhase_ != Ep0InXferPhase::Idle ||
        pendingControlOut_ != ControlOutTransfer::None) {
        return;
    }
    volatile bool &notificationInFlight = userPort ? userNotificationInFlight_ : notificationInFlight_;
    volatile bool &notificationPending = userPort ? userNotificationPending_ : notificationPending_;
    if (!configured_ || notificationInFlight || !notificationPending) {
        return;
    }

    uint8_t *buffer = userPort ? &userNotificationBuffer_[0] : &notificationBuffer_[0];
    const uint8_t endpoint = userPort ? USER_NOTIFICATION_EP : SERVICE_NOTIFICATION_EP;
    reg32(USBD_BASE, epinPtrOffset(endpoint)) = reinterpret_cast<uint32_t>(buffer);
    reg32(USBD_BASE, epinMaxcntOffset(endpoint)) = 10UL;
    if (!userPort) {
        diagResetAtUsbdBeginStage(19UL);
    }
    if (!triggerEndpointStartTask(taskStartEpinOffset(endpoint))) {
        return;
    }
    notificationPending = false;
    notificationInFlight = true;
    if (!userPort) {
        diagResetAtUsbdBeginStage(20UL);
    }
}

void NrfUsbdDriver::serviceSetup() {
    // A SETUP token aborts any older control transfer. Do not let a short or
    // interrupted class OUT request retain ownership of EP0 and consume the
    // payload/status event belonging to the new request.
    pendingControlOut_ = ControlOutTransfer::None;
    controlOutExpected_ = 0U;
    controlOutLength_ = 0U;
    pendingAddressValid_ = false;
    resetEp0InXferState();

    const uint8_t requestType = static_cast<uint8_t>(reg32(USBD_BASE, BMREQUESTTYPE) & 0xFFUL);
    const uint8_t request = static_cast<uint8_t>(reg32(USBD_BASE, BREQUEST) & 0xFFUL);
    const uint16_t value = static_cast<uint16_t>((reg32(USBD_BASE, WVALUEH) << 8U) | reg32(USBD_BASE, WVALUEL));
    const uint16_t index = static_cast<uint16_t>((reg32(USBD_BASE, WINDEXH) << 8U) | reg32(USBD_BASE, WINDEXL));
    const uint16_t length = static_cast<uint16_t>((reg32(USBD_BASE, WLENGTHH) << 8U) | reg32(USBD_BASE, WLENGTHL));
    ep0InRequested_ = length;

    switch (requestType & 0x60U) {
        case USB_REQ_TYPE_STANDARD:
            handleStandardRequest(request, value, index, length);
            break;
        case USB_REQ_TYPE_CLASS:
            handleClassRequest(requestType, request, value, index, length);
            break;
        default:
            stallControlEndpoint();
            break;
    }
}

void NrfUsbdDriver::completeControlOutTransfer() {
    controlOutLength_ = reg32(USBD_BASE, epoutAmountOffset(0U));

    if (controlOutLength_ != controlOutExpected_) {
        // CDC line coding is a fixed-size request. A short/overlong data stage
        // is malformed and must not partially update state or receive a false
        // success status.
        pendingControlOut_ = ControlOutTransfer::None;
        controlOutExpected_ = 0U;
        controlOutLength_ = 0U;
        stallControlEndpoint();
        return;
    }

    switch (pendingControlOut_) {
        case ControlOutTransfer::ServiceLineCoding:
            if (controlOutLength_ == 7U) {
                const uint8_t stopBits = controlOutBuffer_[4];
                const uint8_t parity = controlOutBuffer_[5];
                const uint8_t dataBits = controlOutBuffer_[6];
                if (!validCdcLineCoding(stopBits, parity, dataBits)) {
                    pendingControlOut_ = ControlOutTransfer::None;
                    controlOutExpected_ = 0U;
                    controlOutLength_ = 0U;
                    stallControlEndpoint();
                    return;
                }
                const uint32_t baudRate =
                    static_cast<uint32_t>(controlOutBuffer_[0]) |
                    (static_cast<uint32_t>(controlOutBuffer_[1]) << 8U) |
                    (static_cast<uint32_t>(controlOutBuffer_[2]) << 16U) |
                    (static_cast<uint32_t>(controlOutBuffer_[3]) << 24U);
                lineCoding_ = {baudRate, stopBits, parity, dataBits};
                if (lineCoding_.baudRate != 1200UL) {
                    // Don't let the host's post-touch 115200 re-open cancel a
                    // touch that is already counting down its confirm window.
                    const bool inConfirmWindow = serviceTouchResetMillis_ != 0UL &&
                        (millis() - serviceTouchResetMillis_) < USBD_TOUCH_RESET_CONFIRM_MS;
                    if (!inConfirmWindow) {
                        serviceTouchPending_ = false;
                        serviceTouchResetMillis_ = 0UL;
                    }
                } else {
                    markResetCauseIfUnset(USBD_DIAG_CAUSE_1200_LINE_CODING);
                    serviceSaw1200Millis_ = millis();
                    // Line coding alone is not an upload gesture. Windows can
                    // replay a port's saved 1200-baud setting while DTR is
                    // already low during enumeration. Arming here made that
                    // harmless replay turn into a delayed reboot and apparent
                    // COM-port loss. SET_CONTROL_LINE_STATE owns the explicit
                    // DTR high-to-low edge that authorizes bootloader entry.
                }
            }
            sendZeroLengthStatus();
            break;
        case ControlOutTransfer::UserLineCoding:
            if (controlOutLength_ == 7U) {
                const uint8_t stopBits = controlOutBuffer_[4];
                const uint8_t parity = controlOutBuffer_[5];
                const uint8_t dataBits = controlOutBuffer_[6];
                if (!validCdcLineCoding(stopBits, parity, dataBits)) {
                    pendingControlOut_ = ControlOutTransfer::None;
                    controlOutExpected_ = 0U;
                    controlOutLength_ = 0U;
                    stallControlEndpoint();
                    return;
                }
                const uint32_t baudRate =
                    static_cast<uint32_t>(controlOutBuffer_[0]) |
                    (static_cast<uint32_t>(controlOutBuffer_[1]) << 8U) |
                    (static_cast<uint32_t>(controlOutBuffer_[2]) << 16U) |
                    (static_cast<uint32_t>(controlOutBuffer_[3]) << 24U);
                userLineCoding_ = {baudRate, stopBits, parity, dataBits};
            }
            sendZeroLengthStatus();
            break;
        case ControlOutTransfer::None:
        default:
            break;
    }

    pendingControlOut_ = ControlOutTransfer::None;
    controlOutExpected_ = 0U;
    controlOutLength_ = 0U;
}

bool NrfUsbdDriver::interfaceExists(uint8_t interfaceNumber) const {
    size_t offset = 0U;
    while (offset + 2U <= configurationDescriptorLength_) {
        const uint8_t descriptorLength = configurationDescriptor_[offset];
        if (descriptorLength < 2U || offset + descriptorLength > configurationDescriptorLength_) {
            return false;
        }
        if (configurationDescriptor_[offset + 1U] == USB_DESC_INTERFACE &&
            descriptorLength >= 9U &&
            configurationDescriptor_[offset + 2U] == interfaceNumber) {
            return true;
        }
        offset += descriptorLength;
    }
    return false;
}

bool NrfUsbdDriver::endpointDescriptorAttributes(uint8_t endpointAddress, uint8_t &attributes) const {
    size_t offset = 0U;
    while (offset + 2U <= configurationDescriptorLength_) {
        const uint8_t descriptorLength = configurationDescriptor_[offset];
        if (descriptorLength < 2U || offset + descriptorLength > configurationDescriptorLength_) {
            return false;
        }
        if (configurationDescriptor_[offset + 1U] == USB_DESC_ENDPOINT &&
            descriptorLength >= 7U &&
            configurationDescriptor_[offset + 2U] == endpointAddress) {
            attributes = configurationDescriptor_[offset + 3U];
            return true;
        }
        offset += descriptorLength;
    }
    return false;
}

