dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
bool NrfUsbdDriver::endpointRequestValid(uint16_t index,
                                         uint8_t &endpointAddress,
                                         uint8_t &attributes) const {
    if ((index & 0xFF70U) != 0U) {
        return false;
    }
    endpointAddress = static_cast<uint8_t>(index & 0x008FU);
    const uint8_t endpoint = static_cast<uint8_t>(endpointAddress & 0x0FU);
    if (!configured_ || endpoint == 0U || endpoint >= USB_MAX_ENDPOINTS) {
        return false;
    }
    return endpointDescriptorAttributes(endpointAddress, attributes) &&
           (attributes & 0x03U) != 0x01U;  // ENDPOINT_HALT is invalid for isochronous endpoints.
}

void NrfUsbdDriver::setEndpointHalt(uint8_t endpointAddress, bool halted) {
    const uint8_t endpoint = static_cast<uint8_t>(endpointAddress & 0x0FU);
    volatile uint8_t &bitmap = (endpointAddress & USB_DIR_IN) != 0U
        ? haltedInEndpoints_
        : haltedOutEndpoints_;
    if (halted) {
        stallEndpoint(endpointAddress);
        bitmap = static_cast<uint8_t>(bitmap | endpointMask(endpoint));
    } else {
        // If the host ACKed the last IN packet immediately before issuing
        // CLEAR_FEATURE, commit that acknowledgement before resetting the
        // endpoint. Otherwise preserve queued CDC bytes for retransmission.
        const uint32_t ackBit = endpointMask(endpoint);
        const bool inEndpoint = (endpointAddress & USB_DIR_IN) != 0U;
        const bool acked = inEndpoint && (reg32(USBD_BASE, EPDATASTATUS) & ackBit) != 0U;
        if (acked) {
            if (endpoint == SERVICE_DATA_EP && dataInFlight_) {
                txTail_ = (txTail_ + dataInFlightLength_) % USBD_RING_BUFFER_SIZE;
            } else if (userPortEnabled() && endpoint == USER_DATA_EP && userDataInFlight_) {
                userTxTail_ = (userTxTail_ + userDataInFlightLength_) % USBD_RING_BUFFER_SIZE;
            } else if (endpoint >= firstDynamicEndpoint() && dynamicInBusy_[endpoint]) {
                PluggableUSB().endpointInComplete(endpoint);
            }
            reg32(USBD_BASE, EPDATASTATUS) = ackBit;
        }

        if (inEndpoint && endpoint == SERVICE_DATA_EP) {
            dataInFlight_ = false;
            dataInFlightLength_ = 0U;
        } else if (inEndpoint && endpoint == SERVICE_NOTIFICATION_EP) {
            notificationInFlight_ = false;
        } else if (inEndpoint && userPortEnabled() && endpoint == USER_DATA_EP) {
            userDataInFlight_ = false;
            userDataInFlightLength_ = 0U;
        } else if (inEndpoint && userPortEnabled() && endpoint == USER_NOTIFICATION_EP) {
            userNotificationInFlight_ = false;
        } else if (inEndpoint && endpoint >= firstDynamicEndpoint()) {
            dynamicInBusy_[endpoint] = false;
            dynamicInLengths_[endpoint] = 0U;
        }
        clearEndpointStall(endpointAddress);
        clearEndpointToggle(endpointAddress);
        bitmap = static_cast<uint8_t>(bitmap & ~endpointMask(endpoint));
    }
}

bool NrfUsbdDriver::endpointHalted(uint8_t endpointAddress) const {
    const uint8_t endpoint = static_cast<uint8_t>(endpointAddress & 0x0FU);
    const uint8_t bitmap = (endpointAddress & USB_DIR_IN) != 0U
        ? haltedInEndpoints_
        : haltedOutEndpoints_;
    return (bitmap & endpointMask(endpoint)) != 0U;
}

void NrfUsbdDriver::handleStandardRequest(uint8_t request, uint16_t value, uint16_t index, uint16_t length) {
    const uint8_t requestType = static_cast<uint8_t>(reg32(USBD_BASE, BMREQUESTTYPE) & 0xFFUL);
    const uint8_t recipient = static_cast<uint8_t>(reg32(USBD_BASE, BMREQUESTTYPE) & 0x1FU);

    switch (request) {
        case USB_REQ_GET_DESCRIPTOR: {
            const uint8_t descriptorType = static_cast<uint8_t>((value >> 8U) & 0xFFU);
            const uint8_t descriptorIndex = static_cast<uint8_t>(value & 0xFFU);
            if (descriptorType == USB_DESC_DEVICE) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_DEVICE) ||
                    descriptorIndex != 0U || index != 0U) {
                    stallControlEndpoint();
                    return;
                }
                size_t descriptorLength = length;
                if (descriptorLength > sizeof(deviceDescriptor_)) {
                    descriptorLength = sizeof(deviceDescriptor_);
                }
                startControlIn(deviceDescriptor_, descriptorLength);
                return;
            }
            if (descriptorType == USB_DESC_CONFIGURATION) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_DEVICE) ||
                    descriptorIndex != 0U || index != 0U) {
                    stallControlEndpoint();
                    return;
                }
                size_t descriptorLength = length;
                if (descriptorLength > configurationDescriptorLength_) {
                    descriptorLength = configurationDescriptorLength_;
                }
                startControlIn(configurationDescriptor_, descriptorLength);
                return;
            }
            if (descriptorType == USB_DESC_STRING) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_DEVICE) ||
                    (descriptorIndex == 0U ? index != 0U : (index != 0U && index != 0x0409U))) {
                    stallControlEndpoint();
                    return;
                }
                if (descriptorIndex == 0U) {
                    controlInBuffer_[0] = 4U;
                    controlInBuffer_[1] = USB_DESC_STRING;
                    controlInBuffer_[2] = 0x09U;
                    controlInBuffer_[3] = 0x04U;
                    startControlIn(controlInBuffer_, 4U);
                    return;
                }

                const NrfSystemProfile &profile = nrfSystemProfile();
                const char *text = nullptr;
                // iSerialNumber (descriptor index 3) must reproduce the
                // bootloader's chip-UID-derived serial so Windows treats
                // user firmware as the same device-instance as the
                // bootloader and reuses the same COM port assignment.
                // Adafruit's UF2 bootloader formats this from the 64-bit
                // FICR->DEVICEID value byte-wise in little-endian memory
                // order, then reverses the resulting hex string.
                // Matching that exact algorithm matters more than which raw
                // register looks semantically nicer.
                static char serialBuffer[17] = {0};
                if (descriptorIndex == USB_STRING_MANUFACTURER) {
                    text = "NiusRobotLab";
                } else if (descriptorIndex == USB_STRING_PRODUCT) {
                    text = profile.usbProduct;
                } else if (descriptorIndex == USB_STRING_SERIAL) {
                    constexpr uint32_t FICR_BASE = 0x10000000UL;
                    constexpr uint32_t FICR_DEVICEID0 = 0x060UL;
                    constexpr uint32_t FICR_DEVICEID1 = 0x064UL;
                    const uint32_t deviceId0 = reg32(FICR_BASE, FICR_DEVICEID0);
                    const uint32_t deviceId1 = reg32(FICR_BASE, FICR_DEVICEID1);
                    static const char hex[] = "0123456789ABCDEF";
                    const uint8_t deviceIdBytes[8] = {
                        static_cast<uint8_t>(deviceId0 & 0xFFU),
                        static_cast<uint8_t>((deviceId0 >> 8U) & 0xFFU),
                        static_cast<uint8_t>((deviceId0 >> 16U) & 0xFFU),
                        static_cast<uint8_t>((deviceId0 >> 24U) & 0xFFU),
                        static_cast<uint8_t>(deviceId1 & 0xFFU),
                        static_cast<uint8_t>((deviceId1 >> 8U) & 0xFFU),
                        static_cast<uint8_t>((deviceId1 >> 16U) & 0xFFU),
                        static_cast<uint8_t>((deviceId1 >> 24U) & 0xFFU),
                    };
                    for (size_t byteIndex = 0; byteIndex < 8U; ++byteIndex) {
                        const uint8_t value = deviceIdBytes[byteIndex];
                        for (size_t nibbleIndex = 0; nibbleIndex < 2U; ++nibbleIndex) {
                            const uint8_t nibble = static_cast<uint8_t>((value >> (nibbleIndex * 4U)) & 0x0FU);
                            serialBuffer[15U - ((byteIndex * 2U) + nibbleIndex)] = hex[nibble];
                        }
                    }
                    serialBuffer[16] = '\0';
                    text = serialBuffer;
                } else if (descriptorIndex == USB_STRING_SERVICE_CONTROL) {
                    text = "Nius Service CDC";
                } else if (descriptorIndex == USB_STRING_SERVICE_DATA) {
                    text = "Nius Service Data";
                } else if (descriptorIndex == USB_STRING_USER_CONTROL) {
                    text = "Nius User CDC";
                } else if (descriptorIndex == USB_STRING_USER_DATA) {
                    text = "Nius User Data";
                } else if (descriptorIndex == USB_STRING_DFU) {
#if !defined(NRF_USB_RUNTIME_DISABLE_APP_DFU) || (NRF_USB_RUNTIME_DISABLE_APP_DFU == 0)
                    text = "Nius Bootloader Control";
#endif
                } else {
                    stallControlEndpoint();
                    return;
                }
                if (text == nullptr ||
                    ((!userPortEnabled()) &&
                     (descriptorIndex == USB_STRING_USER_CONTROL || descriptorIndex == USB_STRING_USER_DATA))) {
                    stallControlEndpoint();
                    return;
                }
                const size_t stringLength = copyUsbStringDescriptor(text, controlInBuffer_, sizeof(controlInBuffer_));
                size_t descriptorLength = length;
                if (descriptorLength > stringLength) {
                    descriptorLength = stringLength;
                }
                startControlIn(controlInBuffer_, descriptorLength);
                return;
            }

            USBSetup setup = {static_cast<uint8_t>(reg32(USBD_BASE, BMREQUESTTYPE) & 0xFFUL), request, value, index, length};
            PluggableUSB().beginDescriptorBuild(controlInBuffer_, sizeof(controlInBuffer_));
            const int descriptorLength = PluggableUSB().getDescriptor(setup);
            const size_t builtLength = PluggableUSB().endDescriptorBuild();
            if (descriptorLength > 0 &&
                builtLength == static_cast<size_t>(descriptorLength)) {
                size_t responseLength = length;
                if (responseLength > static_cast<size_t>(descriptorLength)) {
                    responseLength = static_cast<size_t>(descriptorLength);
                }
                startControlIn(controlInBuffer_, responseLength);
                return;
            }

            stallControlEndpoint();
            return;
        }
        case USB_REQ_SET_ADDRESS:
            if (requestType != (USB_DIR_OUT | USB_REQ_RECIPIENT_DEVICE) ||
                value > 127U || index != 0U || length != 0U || configured_) {
                stallControlEndpoint();
                return;
            }
            pendingAddress_ = static_cast<uint8_t>(value);
            pendingAddressValid_ = true;
            diagResetAtUsbdBeginStage(9UL);
            sendZeroLengthStatus();
            return;
        case USB_REQ_SET_CONFIGURATION:
            if (requestType != (USB_DIR_OUT | USB_REQ_RECIPIENT_DEVICE) ||
                value > 1U || index != 0U || length != 0U ||
                !configurationRequestAllowed(address_)) {
                stallControlEndpoint();
                return;
            }
            configuration_ = static_cast<uint8_t>(value);
            configured_ = configuration_ != 0U;
            // SET_CONFIGURATION establishes a new function session even when
            // the host repeats value 1. Do not carry a previous session's DTR,
            // line coding, or recent-1200 evidence into an upload decision.
            dtr_ = false;
            rts_ = false;
            dtrAssertedMillis_ = 0U;
            userDtr_ = false;
            userRts_ = false;
            userDtrAssertedMillis_ = 0U;
            lineCoding_ = {115200UL, 0U, 0U, 8U};
            userLineCoding_ = {115200UL, 0U, 0U, 8U};
            serviceSaw1200Millis_ = 0UL;
            serviceTouchPending_ = false;
            serviceTouchResetMillis_ = 0U;
            ignoredResetTouchCount_ = 0U;
            if (configured_) {
                // SET_CONFIGURATION establishes a fresh endpoint state even
                // when the host selects configuration 1 repeatedly.
                reg32(USBD_BASE, EPINEN) = endpointMask(0U);
                reg32(USBD_BASE, EPOUTEN) = endpointMask(0U);
                haltedInEndpoints_ = 0U;
                haltedOutEndpoints_ = 0U;
                dataInFlight_ = false;
                dataInFlightLength_ = 0U;
                notificationInFlight_ = false;
                notificationPending_ = false;
                userDataInFlight_ = false;
                userDataInFlightLength_ = 0U;
                userNotificationInFlight_ = false;
                userNotificationPending_ = false;
                resetDynamicEndpoints();
                configuredMillis_ = millis();
                startCdcEndpoints();
            } else {
                configuredMillis_ = 0UL;
                cdcActive_ = false;
                dataInFlight_ = false;
                dataInFlightLength_ = 0U;
                notificationInFlight_ = false;
                notificationPending_ = false;
                userDataInFlight_ = false;
                userDataInFlightLength_ = 0U;
                userNotificationInFlight_ = false;
                userNotificationPending_ = false;
                haltedInEndpoints_ = 0U;
                haltedOutEndpoints_ = 0U;
                reg32(USBD_BASE, EPINEN) = endpointMask(0U);
                reg32(USBD_BASE, EPOUTEN) = endpointMask(0U);
                resetDynamicEndpoints();
            }
            updateSerialState(false);
            if (userPortEnabled()) {
                updateSerialState(true);
            }
            diagResetAtUsbdBeginStage(10UL);
            sendZeroLengthStatus();
            diagResetAtUsbdBeginStage(11UL);
            return;
        case USB_REQ_GET_CONFIGURATION:
            if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_DEVICE) ||
                value != 0U || index != 0U || length != 1U ||
                !configurationRequestAllowed(address_)) {
                stallControlEndpoint();
                return;
            }
            controlInBuffer_[0] = configuration_;
            startControlIn(controlInBuffer_, 1U);
            return;
        case USB_REQ_GET_STATUS: {
            if ((requestType & USB_DIR_IN) == 0U || value != 0U || length != 2U) {
                stallControlEndpoint();
                return;
            }
            controlInBuffer_[0] = 0U;
            controlInBuffer_[1] = 0U;
            if (recipient == USB_REQ_RECIPIENT_DEVICE) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_DEVICE) || index != 0U) {
                    stallControlEndpoint();
                    return;
                }
            } else if (recipient == USB_REQ_RECIPIENT_INTERFACE) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_INTERFACE) ||
                    !configured_ || (index & 0xFF00U) != 0U ||
                    !interfaceExists(static_cast<uint8_t>(index))) {
                    stallControlEndpoint();
                    return;
                }
            } else if (recipient == USB_REQ_RECIPIENT_ENDPOINT) {
                if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_ENDPOINT) ||
                    (index & 0xFF70U) != 0U) {
                    stallControlEndpoint();
                    return;
                }
                const uint8_t endpointAddress = static_cast<uint8_t>(index & 0x008FU);
                const uint8_t endpoint = static_cast<uint8_t>(endpointAddress & 0x0FU);
                uint8_t attributes = 0U;
                if (endpoint >= USB_MAX_ENDPOINTS ||
                    (endpoint != 0U &&
                     (!configured_ || !endpointDescriptorAttributes(endpointAddress, attributes)))) {
                    stallControlEndpoint();
                    return;
                }
                controlInBuffer_[0] = endpointHalted(endpointAddress) ? 1U : 0U;
            } else {
                stallControlEndpoint();
                return;
            }
            startControlIn(controlInBuffer_, 2U);
            return;
        }
        case USB_REQ_CLEAR_FEATURE:
        case USB_REQ_SET_FEATURE: {
            if (requestType != (USB_DIR_OUT | USB_REQ_RECIPIENT_ENDPOINT) ||
                value != USB_FEATURE_ENDPOINT_HALT || length != 0U) {
                stallControlEndpoint();
                return;
            }
            uint8_t endpointAddress = 0U;
            uint8_t attributes = 0U;
            if (!endpointRequestValid(index, endpointAddress, attributes)) {
                stallControlEndpoint();
                return;
            }
            setEndpointHalt(endpointAddress, request == USB_REQ_SET_FEATURE);
            sendZeroLengthStatus();
            return;
        }
        case USB_REQ_GET_INTERFACE:
            if (requestType != (USB_DIR_IN | USB_REQ_RECIPIENT_INTERFACE) ||
                value != 0U || length != 1U || !configured_ ||
                (index & 0xFF00U) != 0U || !interfaceExists(static_cast<uint8_t>(index))) {
                stallControlEndpoint();
                return;
            }
            controlInBuffer_[0] = 0U;
            startControlIn(controlInBuffer_, 1U);
            return;
        case USB_REQ_SET_INTERFACE:
            if (requestType != (USB_DIR_OUT | USB_REQ_RECIPIENT_INTERFACE) ||
                value != 0U || length != 0U || !configured_ ||
                (index & 0xFF00U) != 0U || !interfaceExists(static_cast<uint8_t>(index))) {
                stallControlEndpoint();
                return;
            }
            sendZeroLengthStatus();
            return;
        default:
            {
                USBSetup setup = {requestType, request, value, index, length};
                if (pluggableControlOutSupported(length) &&
                    PluggableUSB().setup(setup)) {
                    sendZeroLengthStatus();
                    return;
                }
            }
            stallControlEndpoint();
            return;
    }
}

void NrfUsbdDriver::handleClassRequest(uint8_t requestType, uint8_t request, uint16_t value, uint16_t index, uint16_t length) {
    diagResetAtUsbdBeginStage(12UL);
    const uint8_t recipient = requestType & 0x1FU;
    const bool directionIn = (requestType & USB_DIR_IN) != 0U;
    if (recipient != USB_REQ_RECIPIENT_INTERFACE || !configured_) {
        stallControlEndpoint();
        return;
    }

    if ((index & 0xFF00U) != 0U) {
        stallControlEndpoint();
        return;
    }

