dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
    const uint8_t interfaceIndex = static_cast<uint8_t>(index & 0xFFU);
    if (!interfaceExists(interfaceIndex)) {
        stallControlEndpoint();
        return;
    }
    if (interfaceIndex == SERVICE_CONTROL_INTERFACE || (userPortEnabled() && interfaceIndex == USER_CONTROL_INTERFACE)) {
        const bool userCdc = interfaceIndex == USER_CONTROL_INTERFACE;
        NrfUsbLineCoding &lineCoding = userCdc ? userLineCoding_ : lineCoding_;
        volatile bool &dtr = userCdc ? userDtr_ : dtr_;
        volatile bool &rts = userCdc ? userRts_ : rts_;
        switch (request) {
            case CDC_REQ_SET_LINE_CODING:
                if (requestType != (USB_DIR_OUT | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    value != 0U || length != 7U) {
                    stallControlEndpoint();
                    return;
                }
                expectControlOut(userCdc ? ControlOutTransfer::UserLineCoding : ControlOutTransfer::ServiceLineCoding, 7U);
                diagResetAtUsbdBeginStage(13UL);
                return;
            case CDC_REQ_GET_LINE_CODING:
                if (requestType != (USB_DIR_IN | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    value != 0U || length != 7U) {
                    stallControlEndpoint();
                    return;
                }
                controlInBuffer_[0] = static_cast<uint8_t>(lineCoding.baudRate & 0xFFU);
                controlInBuffer_[1] = static_cast<uint8_t>((lineCoding.baudRate >> 8U) & 0xFFU);
                controlInBuffer_[2] = static_cast<uint8_t>((lineCoding.baudRate >> 16U) & 0xFFU);
                controlInBuffer_[3] = static_cast<uint8_t>((lineCoding.baudRate >> 24U) & 0xFFU);
                controlInBuffer_[4] = lineCoding.stopBits;
                controlInBuffer_[5] = lineCoding.parity;
                controlInBuffer_[6] = lineCoding.dataBits;
                {
                    size_t responseLength = length;
                    if (responseLength > 7U) {
                        responseLength = 7U;
                    }
                    startControlIn(controlInBuffer_, responseLength);
                }
                diagResetAtUsbdBeginStage(14UL);
                return;
            case CDC_REQ_SET_CONTROL_LINE_STATE:
                if (requestType != (USB_DIR_OUT | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    (value & 0xFFFCU) != 0U || length != 0U) {
                    stallControlEndpoint();
                    return;
                }
                {
                    const bool nextDtr = (value & 0x0001U) != 0U;
                    const bool previousDtr = dtr;
                    volatile uint32_t &dtrAssertedMillis =
                        userCdc ? userDtrAssertedMillis_ : dtrAssertedMillis_;
                    if (nextDtr && !dtr) {
                        dtrAssertedMillis = millis();
                    } else if (!nextDtr) {
                        dtrAssertedMillis = 0UL;
                    }
                    dtr = nextDtr;
                    rts = (value & 0x0002U) != 0U;
                    updateSerialState(userCdc);
                    const bool resetArmed = configuredMillis_ != 0UL &&
                        (millis() - configuredMillis_) >= USBD_1200_RESET_ARM_MS;
                    // Accept the touch if the line is at 1200 now OR was at 1200
                    // very recently: a host's single-port (usbcdc=disabled)
                    // sequence can drop DTR a few ms after the baud has already
                    // reverted, so requiring exact coincidence could miss the
                    // DTR-drop that arms the touch.
                    const bool recent1200 = lineCoding_.baudRate == 1200UL ||
                        (serviceSaw1200Millis_ != 0UL &&
                         (millis() - serviceSaw1200Millis_) < 400UL);
                    if (!userCdc && recent1200) {
                        if (explicitTouchGesture(previousDtr, nextDtr, recent1200, resetArmed)) {
                            // Host dropped DTR at 1200 baud: arm the touch and start the 40 ms
                            // confirm timer (see USBD_TOUCH_RESET_CONFIRM_MS). The poll/IRQ gate
                            // confirms by writing the GPREGRET magic and triggering SYSRESETREQ.
                            markResetCauseIfUnset(USBD_DIAG_CAUSE_1200_TOUCH_PENDING);
                            serviceTouchPending_ = true;
                            serviceTouchResetMillis_ = millis();
                        } else if (serviceTouchResetMillis_ == 0UL) {
                            // V1 latch fix: once the confirm window has started
                            // (serviceTouchResetMillis_ != 0) we must NOT cancel the pending
                            // touch on a subsequent DTR=true. Windows usbser.sys re-asserts
                            // DTR on SerialPort.Close() and again on the next CreateFile()
                            // (adafruit-nrfutil opens the port immediately after the touch),
                            // so the host-side touch sequence inevitably ends with DTR back
                            // high within tens of ms. Cancelling here would defeat the touch.
                            serviceTouchPending_ = false;
                            serviceTouchResetMillis_ = 0UL;
                        }
                    } else if (!userCdc) {
                        serviceTouchPending_ = false;
                        serviceTouchResetMillis_ = 0UL;
                    }
                }
                diagResetAtUsbdBeginStage(15UL);
                sendZeroLengthStatus();
                return;
            default:
                stallControlEndpoint();
                return;
        }
    }

#if !defined(NRF_USB_RUNTIME_DISABLE_APP_DFU) || (NRF_USB_RUNTIME_DISABLE_APP_DFU == 0)
    if (interfaceIndex == dfuInterfaceNumber()) {
        switch (request) {
            case DFU_REQ_DETACH:
                if (requestType != (USB_DIR_OUT | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    length != 0U) {
                    stallControlEndpoint();
                    return;
                }
                detachCause_ = USBD_DIAG_CAUSE_DFU_DETACH;
                detachRequestedMillis_ = millis();
                detachRequestMagic_ = USBD_DETACH_REQUEST_MAGIC;
                sendZeroLengthStatus();
                return;
            case DFU_REQ_GETSTATUS:
                if (requestType != (USB_DIR_IN | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    value != 0U || length != 6U) {
                    stallControlEndpoint();
                    return;
                }
                controlInBuffer_[0] = DFU_STATUS_OK;
                controlInBuffer_[1] = 1U;
                controlInBuffer_[2] = 0U;
                controlInBuffer_[3] = 0U;
                controlInBuffer_[4] = DFU_STATE_APP_IDLE;
                controlInBuffer_[5] = 0U;
                {
                    size_t responseLength = length;
                    if (responseLength > 6U) {
                        responseLength = 6U;
                    }
                    startControlIn(controlInBuffer_, responseLength);
                }
                return;
            case DFU_REQ_GETSTATE:
                if (requestType != (USB_DIR_IN | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE) ||
                    value != 0U || length != 1U) {
                    stallControlEndpoint();
                    return;
                }
                controlInBuffer_[0] = DFU_STATE_APP_IDLE;
                startControlIn(controlInBuffer_, 1U);
                return;
            default:
                stallControlEndpoint();
                return;
        }
    }
#endif

    {
        USBSetup setup = {requestType, request, value, index, length};
        if (directionIn) {
            PluggableUSB().beginDescriptorBuild(controlInBuffer_, sizeof(controlInBuffer_));
            const int responseLength = PluggableUSB().getSetupResponse(setup);
            const size_t builtLength = PluggableUSB().endDescriptorBuild();
            if (responseLength > 0 &&
                builtLength == static_cast<size_t>(responseLength)) {
                size_t actualLength = length;
                if (actualLength > static_cast<size_t>(responseLength)) {
                    actualLength = static_cast<size_t>(responseLength);
                }
                startControlIn(controlInBuffer_, actualLength);
                return;
            }
        } else if (pluggableControlOutSupported(length) &&
                   PluggableUSB().setup(setup)) {
            sendZeroLengthStatus();
            return;
        }
    }

    stallControlEndpoint();
}

void NrfUsbdDriver::resetEp0InXferState() {
    ep0InXferPhase_ = Ep0InXferPhase::Idle;
    ep0InRemaining_ = 0U;
    ep0InRequested_ = 0U;
    ep0InCursor_ = nullptr;
    ep0InNeedsZlp_ = false;
}

void NrfUsbdDriver::sendEp0ControlInChunkOrAdvanceStatus() {
    if (ep0InXferPhase_ != Ep0InXferPhase::Data) {
        return;
    }
    if (ep0InRemaining_ > 0U) {
        size_t chunk = ep0InRemaining_;
        if (chunk > CONTROL_EP_MAX_PACKET) {
            chunk = CONTROL_EP_MAX_PACKET;
        }
        std::memmove(controlInBuffer_, ep0InCursor_, chunk);
        ep0InCursor_ += chunk;
        ep0InRemaining_ = static_cast<uint16_t>(ep0InRemaining_ - static_cast<uint16_t>(chunk));
        reg32(USBD_BASE, epinPtrOffset(0U)) = reinterpret_cast<uint32_t>(&controlInBuffer_[0]);
        reg32(USBD_BASE, epinMaxcntOffset(0U)) = static_cast<uint32_t>(chunk);
        if (!triggerEndpointStartTask(taskStartEpinOffset(0U))) {
            resetEp0InXferState();
            stallControlEndpoint();
        }
        return;
    }
    if (ep0InNeedsZlp_) {
        ep0InNeedsZlp_ = false;
        reg32(USBD_BASE, epinPtrOffset(0U)) = reinterpret_cast<uint32_t>(&controlInBuffer_[0]);
        reg32(USBD_BASE, epinMaxcntOffset(0U)) = 0UL;
        if (!triggerEndpointStartTask(taskStartEpinOffset(0U))) {
            resetEp0InXferState();
            stallControlEndpoint();
        }
        return;
    }
    ep0InXferPhase_ = Ep0InXferPhase::StatusPending;
    sendZeroLengthStatus();
}

void NrfUsbdDriver::startControlIn(const uint8_t *data, size_t length) {
    ep0InXferPhase_ = Ep0InXferPhase::Data;
    const uint16_t actualLength = static_cast<uint16_t>(length > 0xFFFFU ? 0xFFFFU : length);
    ep0InRemaining_ = actualLength;
    ep0InCursor_ = data;
    ep0InNeedsZlp_ = controlInNeedsZlp(actualLength, ep0InRequested_);
    sendEp0ControlInChunkOrAdvanceStatus();
}

void NrfUsbdDriver::expectControlOut(ControlOutTransfer transferType, size_t length) {
    pendingControlOut_ = transferType;
    controlOutExpected_ = length;
    controlOutLength_ = 0U;
    reg32(USBD_BASE, epoutPtrOffset(0U)) = reinterpret_cast<uint32_t>(&controlOutBuffer_[0]);
    reg32(USBD_BASE, epoutMaxcntOffset(0U)) = static_cast<uint32_t>(length);
    reg32(USBD_BASE, TASKS_EP0RCVOUT) = 1UL;
}

void NrfUsbdDriver::sendZeroLengthStatus() {
    reg32(USBD_BASE, epinPtrOffset(0U)) = reinterpret_cast<uint32_t>(&controlInBuffer_[0]);
    reg32(USBD_BASE, epinMaxcntOffset(0U)) = 0UL;
    reg32(USBD_BASE, TASKS_EP0STATUS) = 1UL;
    // EP0STATUS is a peripheral handshake, not an EasyDMA transfer. There is
    // no second EP0DATADONE after this task on nRF52840, so retaining
    // StatusPending would permanently block every non-control endpoint once
    // EP0 serialization is enabled.
    ep0InXferPhase_ = Ep0InXferPhase::Idle;
}

void NrfUsbdDriver::stallControlEndpoint() {
    reg32(USBD_BASE, TASKS_EP0STALL) = 1UL;
}

void NrfUsbdDriver::completePendingAddress() {
    if (!pendingAddressValid_) {
        return;
    }
    setAddress(pendingAddress_);
    pendingAddressValid_ = false;
}

void NrfUsbdDriver::queueSerialStateNotification(bool userPort) {
    uint8_t *buffer = userPort ? &userNotificationBuffer_[0] : &notificationBuffer_[0];
    volatile uint16_t &serialStateBitmap = userPort ? userSerialStateBitmap_ : serialStateBitmap_;
    volatile bool &notificationPending = userPort ? userNotificationPending_ : notificationPending_;
    buffer[0] = 0xA1U;
    buffer[1] = CDC_NOTIFICATION_SERIAL_STATE;
    buffer[2] = 0x00U;
    buffer[3] = 0x00U;
    buffer[4] = userPort ? USER_CONTROL_INTERFACE : SERVICE_CONTROL_INTERFACE;
    buffer[5] = 0x00U;
    buffer[6] = 0x02U;
    buffer[7] = 0x00U;
    buffer[8] = static_cast<uint8_t>(serialStateBitmap & 0xFFU);
    buffer[9] = static_cast<uint8_t>((serialStateBitmap >> 8U) & 0xFFU);
    notificationPending = true;
}

void NrfUsbdDriver::updateSerialState(bool userPort) {
    const bool asserted = userPort ? (userDtr_ || userRts_) : (dtr_ || rts_);
    volatile uint16_t &serialStateBitmap = userPort ? userSerialStateBitmap_ : serialStateBitmap_;
    uint16_t nextState = 0U;
    if (configured_ && asserted) {
        nextState = CDC_SERIAL_STATE_DCD | CDC_SERIAL_STATE_DSR;
    }
    if (nextState == serialStateBitmap) {
        return;
    }
    serialStateBitmap = nextState;
    queueSerialStateNotification(userPort);
}

