dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfUsbd.cpp
void NrfUsbdDriver::setAddress(uint8_t address) {
    // SET_ADDRESS is applied by nRF USBD hardware after the status stage;
    // USBADDR is read-only. Keep only the software mirror used by status().
    address_ = address;
}

void NrfUsbdDriver::ringPushRx(uint8_t value) {
    ringPush(rxBuffer_, rxHead_, rxTail_, value);
}

bool NrfUsbdDriver::ringPushTx(uint8_t value) {
    return ringPushWithResult(txBuffer_, txHead_, txTail_, value);
}

int NrfUsbdDriver::ringPopRx() {
    return ringPop(rxBuffer_, rxHead_, rxTail_);
}

int NrfUsbdDriver::ringPeekRx() const {
    return ringPeek(rxBuffer_, rxHead_, rxTail_);
}

size_t NrfUsbdDriver::txPending() const {
    return ringPending(txHead_, txTail_);
}

void NrfUsbdDriver::userRingPushRx(uint8_t value) {
    ringPush(userRxBuffer_, userRxHead_, userRxTail_, value);
}

bool NrfUsbdDriver::userRingPushTx(uint8_t value) {
    return ringPushWithResult(userTxBuffer_, userTxHead_, userTxTail_, value);
}

int NrfUsbdDriver::userRingPopRx() {
    return ringPop(userRxBuffer_, userRxHead_, userRxTail_);
}

int NrfUsbdDriver::userRingPeekRx() const {
    return ringPeek(userRxBuffer_, userRxHead_, userRxTail_);
}

size_t NrfUsbdDriver::userTxPending() const {
    return ringPending(userTxHead_, userTxTail_);
}

size_t NrfUsbdDriver::serviceTxQueued() const {
    return txPending();
}

size_t NrfUsbdDriver::userTxQueued() const {
    return userTxPending();
}

extern "C" void USBD_IRQHandler(void) {
    nrfUsbdDriver().irqHandler();
}
